{
  "document_title": "Bài giảng Học phần: CƠ SỞ DỮ LIỆU",
  "structure_type": "Chương/Mục",
  "data": [
    {
      "level_1_title": "CHƯƠNG 1. ĐẠI CƯƠNG VỀ CÁC HỆ CƠ SỞ DỮ LIỆU",
      "level_1_id": "1",
      "content": "Trong nhiều năm gần đây, thuật ngữ Cơ sở dữ liệu - Database đã trở nên quen thuộc trong nhiều lĩnh vực. Các ứng dụng tin học vào quản lý ngày càng nhiều và đa dạng, hầu hết các lĩnh vực kinh tế, xã hội... đều đã ứng dụng các thành tựu mới của tin học vào phục vụ công tác chuyên môn của mình. Chính vì lẽ đó mà ngày càng nhiều người quan tâm đến thiết kế, xây dựng và ứng dụng cơ sở dữ liệu (CSDL). Nội dung chương 1 giới thiệu tổng quan về lý thuyết cơ sở dữ liệu, kiến trúc của một hệ quản trị CSDL, phân loại các hệ CSDL.",
      "children": [
        {
          "level_2_title": "1.1. Tổng quan về lý thuyết cơ sở dữ liệu",
          "level_2_id": "1.1",
          "content": "Để hiểu được các cơ sở kỹ thuật của cơ sở dữ liệu chúng ta phải bắt đầu từ các khái niệm lý thuyết nền tảng của cơ sở dữ liệu truyền thống.",
          "children": [
            {
              "level_3_title": "1.1.1. Giới thiệu chung",
              "level_3_id": "1.1.1",
              "content": "Ngày nay sự thành công của một tổ chức phụ thuộc vào khả năng thu thập dữ liệu chính xác và kịp thời về các hoạt động của mình, để quản lý dữ liệu một cách hiệu quả và sử dụng nó để phân tích, định hướng các hoạt động của mình. Các cụm từ như “Information superhighway” đã trở nên phổ biến và việc xử lý thông tin là một ngành công nghiệp trị giá hàng tỷ đô la đang phát triển nhanh chóng.\nLượng thông tin có sẵn cho chúng ta đang bùng nổ theo đúng nghĩa đen và giá trị của dữ liệu như một tài sản của tổ chức được công nhận rộng rãi. Tuy nhiên, nếu không có khả năng quản lý lượng dữ liệu khổng lồ này và nhanh chóng tìm thấy thông tin liên quan đến một truy vấn nhất định, khi lượng thông tin tăng lên, nó có xu hướng trở thành một thứ gây mất tập trung và trách nhiệm pháp lý hơn là một tài sản. Nghịch lý này thúc đẩy nhu cầu về các hệ thống quản lý dữ liệu ngày càng mạnh mẽ và linh hoạt.\nĐể tận dụng tối đa bộ dữ liệu lớn và phức tạp, người dùng phải có các công cụ giúp đơn giản hóa các tác vụ quản lý dữ liệu và trích xuất thông tin hữu ích kịp thời. Nếu không, dữ liệu có thể trở thành một khoản nợ phải trả, với chi phí mua và quản lý nó vượt xa giá trị thu được từ nó.\nTừ những ngày đầu tiên – đi kèm với sự phát triển của máy tính, lưu trữ và thao tác dữ liệu đã là một trọng tâm chính của ứng dụng.\nHệ thống DBMS đa năng đầu tiên được thiết kế bởi Charles Bachman tại General Electric vào đầu những năm 1960 và được gọi là Kho dữ liệu tích hợp. Nó hình thành nền tảng cho mô hình dữ liệu mạng, được tiêu chuẩn hóa bởi Hội nghị về Ngôn ngữ Hệ thống Dữ liệu (CODASYL) và ảnh hưởng mạnh mẽ đến các hệ thống cơ sở dữ liệu trong suốt những năm 1960. Bachman là người đầu tiên nhận được giải thưởng ACM’s Turing (giải thưởng khoa học máy tính tương đương với giải Nobel) trong lĩnh vực cơ sở dữ liệu vào năm 1973.\nVào cuối những năm 1960, IBM đã phát triển Hệ thống Quản lý Thông tin (IMS) DBMS, thậm chí nó vẫn còn được tối ưu đến ngày nay trong nhiều hệ thống lớn. IMS đã hình thành cơ sở cho một khung biểu diễn dữ liệu thay thế được gọi là mô hình dữ liệu phân cấp. Hệ thống SABER để đặt chỗ của hãng hàng không được American Airlines và IBM cùng phát triển vào khoảng thời gian đó và nó cho phép nhiều người truy cập vào cùng một dữ liệu thông qua một mạng máy tính. Điều thú vị là ngày nay cùng một hệ thống SABER được sử dụng để cung cấp cho các dịch vụ du lịch dựa trên Web phổ biến như Travelocity.\nNăm 1970, Edgar Codd, tại Phòng thí nghiệm nghiên cứu San Jose của IBM, đề xuất một khung biểu diễn dữ liệu mới được gọi là mô hình dữ liệu quan hệ. Điều này đã được chứng minh là một bước ngoặt trong sự phát triển của các hệ thống cơ sở dữ liệu: nó đã thúc đẩy sự phát triển nhanh chóng của một số DBMS dựa trên mô hình quan hệ, cùng với một khối lượng lớn các kết quả lý thuyết đã đặt lĩnh vực này trên một nền tảng vững chắc. Codd đã giành được giải thưởng Turing năm 1981 cho tác phẩm nổi tiếng của mình. Các hệ thống cơ sở dữ liệu đã phát triển thành một lĩnh vực học thuật và sự phổ biến của các DBMS quan hệ đã thay đổi bối cảnh thương mại. Lợi ích của chúng đã được công nhận rộng rãi và việc sử dụng DBMS để quản lý dữ liệu công ty đã trở thành chuẩn hóa.\nTrong những năm 1980, mô hình quan hệ đã củng cố vị trí của nó như là mô hình DBMS thống trị và các hệ thống cơ sở dữ liệu tiếp tục được sử dụng rộng rãi. Ngôn ngữ truy vấn SQL cho cơ sở dữ liệu quan hệ, được phát triển như một phần của dự án Hệ thống R của IBM, hiện là ngôn ngữ truy vấn tiêu chuẩn. SQL được tiêu chuẩn hóa vào cuối những năm 1980 và tiêu chuẩn hiện tại, SQL-92, đã được Viện Tiêu chuẩn Quốc gia Hoa Kỳ (ANSI) và Tổ chức Tiêu chuẩn Quốc tế (ISO) thông qua. Có thể nhận định rằng, hình thức lập trình đồng thời được sử dụng rộng rãi nhất là thực hiện đồng thời các chương trình cơ sở dữ liệu (được gọi là giao dịch).\nNgười dùng viết các chương trình như thể chúng được chạy bởi chính họ và DBMS sẽ có trách nhiệm vận hành chúng hoạt động đồng thời. James Gray đã giành được giải thưởng Turing năm 1999 cho những đóng góp của mình trong lĩnh vực quản lý giao dịch trong DBMS.\nVào cuối những năm 1980 và những năm 1990, lĩnh vực cơ sở dữ liệu đã đạt được nhiều thành tựu tiến bộ mới. Nghiên cứu quan trọng đã được thực hiện nhằm mục đích phát triển các ngôn ngữ truy vấn mạnh mẽ hơn và các mô hình dữ liệu phong phú hơn, đồng thời nhấn mạnh vào việc hỗ trợ phân tích dữ liệu phức tạp từ tất cả các bộ phận của doanh nghiệp. Một số nhà cung cấp (ví dụ: DB2 của IBM, Oracle 8, Informix UDS) đã mở rộng hệ thống của họ với khả năng lưu trữ các kiểu dữ liệu mới như hình ảnh và văn bản, cũng như khả năng yêu cầu các truy vấn phức tạp hơn. Các hệ thống chuyên biệt đã được phát triển bởi nhiều nhà cung cấp để tạo kho dữ liệu, hợp nhất dữ liệu từ một số cơ sở dữ liệu và để thực hiện phân tích cụ thể hóa.\nMột hiện tượng thú vị là sự xuất hiện của một số gói lập kế hoạch tài nguyên doanh nghiệp (ERP) và lập kế hoạch tài nguyên quản lý (MRP), bổ sung đáng kể các tính năng hướng ứng dụng lên trên DBMS. Các gói được sử dụng rộng rãi bao gồm các hệ thống của Baan, Oracle, PeopleSoft, SAP và Siebel. Các gói này xác định một tập hợp các nhiệm vụ phổ biến (ví dụ: quản lý hàng tồn kho, lập kế hoạch nguồn nhân lực, phân tích tài chính) mà một số lượng lớn các tổ chức gặp phải và cung cấp một lớp ứng dụng chung để thực hiện các nhiệm vụ này. Dữ liệu được lưu trữ trong DBMS quan hệ và lớp ứng dụng có thể được tùy chỉnh cho các công ty khác nhau, dẫn đến chi phí tổng thể thấp hơn cho các công ty so với chi phí xây dựng ban đầu.\nĐáng chú ý, DBMSs đã bước vào kỷ nguyên Internet. Trong khi thế hệ đầu tiên của các trang Web lưu trữ riêng dữ liệu của chúng trong các tệp hệ điều hành, việc sử dụng DBMS để lưu trữ dữ liệu được truy cập thông qua trình duyệt Web đang trở nên phổ biến. Các truy vấn được tạo thông qua các biểu mẫu có thể truy cập được trên Web và các câu trả lời được định dạng bằng ngôn ngữ đánh dấu như HTML, để có thể dễ dàng hiển thị trong trình duyệt. Tất cả các nhà cung cấp cơ sở dữ liệu đang thêm các tính năng vào DBMS của họ nhằm mục đích làm cho nó phù hợp hơn để triển khai qua Internet.\nQuản lý cơ sở dữ liệu ngày càng trở nên quan trọng khi có nhiều dữ liệu được đưa vào mạng và dễ tiếp cận hơn thông qua mạng máy tính. Ngày nay, lĩnh vực này đang được thúc đẩy và phát triển theo các hướng mới như cơ sở dữ liệu đa phương tiện, video tương tác, thư viện kỹ thuật số, một loạt các dự án khoa học như nỗ lực lập bản đồ bộ gen người và dự án hệ thống quan sát trái đất của NASA, và mong muốn của các công ty hợp nhất việc ra quyết định của họ xử lý và khai thác kho dữ liệu của họ để có thông tin hữu ích về doanh nghiệp. Về mặt thương mại, hệ thống quản lý cơ sở dữ liệu đại diện cho một trong những phân khúc thị trường lớn nhất và mạnh mẽ nhất. Vì vậy, việc nghiên cứu các hệ thống cơ sở dữ liệu có thể được chứng minh là vô cùng bổ ích theo nhiều cách khác nhau.",
              "children": []
            },
            {
              "level_3_title": "1.1.2. Cơ sở dữ liệu và hệ cơ sở dữ liệu",
              "level_3_id": "1.1.2",
              "content": "Mục đích của chương 1 chỉ đơn giản là cung cấp các khái niệm cơ bản về CSDL để sinh viên có một cái nhìn ban đầu về một cơ sở dữ liệu và một hệ quản trị CSDL. Tuy nhiên để có thể đưa ra được định nghĩa về cơ sở dữ liệu, trước hết trong phần này khái niệm về dữ liệu sẽ được chúng ta đề cập đầu tiên.\nDữ liệu là những số liệu rời rạc mô tả về sự kiện, sự vật, hiện tượng được chọn lọc để lưu trữ với một mục đích nào đó. Hay nói cách khác, theo Elmasri Navathe dữ liệu là những gì chúng ta biết có thể ghi lại được và có ý nghĩa. Một số ví dụ về dữ liệu có thể kể đến như: Dữ liệu về nhân viên, quá trình công tác và chuyên môn trong một công ty, dữ liệu về thời tiết, dữ liệu về công dân của một quốc gia,...",
              "children": [
                {
                  "level_4_title": "1.1.2.1. Định nghĩa cơ sở dữ liệu",
                  "level_4_id": "1.1.2.1",
                  "content": "Định nghĩa: Một cơ sở dữ liệu (tên tiếng Anh là Database), viết tắt là CSDL, là một tập hợp dữ liệu có liên quan với nhau, được lưu trữ trên máy tính, có nhiều người sử dụng và được tổ chức theo một mô hình. Một cơ sở dữ liệu có những tính chất đặc trưng như sau:\n- Biểu diễn một vài khía cạnh nào đó của thế giới thực.\n- Có liên hệ logic thống nhất\n- Được thiết kế và bao gồm những dữ liệu phục vụ một mục đích nào đó.\n- Là một tập các dữ liệu tác nghiệp được lưu trữ lại và được các hệ ứng dụng của một doanh nghiệp cụ thể nào đó sử dụng.\n- Tập ngẫu nhiên của các dữ liệu không thể xem là một CSDL\nVí dụ: Cơ sở dữ liệu trường đại học có thể chứa thông tin:\n- Thực thể (Entity) – Bao gồm các thực thể như Sinh Viên, Giảng Viên, Môn Học, Lớp Học, hay Học Phần.\n- Liên kết (Relationships) - Các mối quan hệ giữa các thực thể, chẳng hạn như việc ghi danh của sinh viên vào các lớp học, các giảng viên chủ nhiệm một số lớp học, hay các học phần được giảng dạy bởi các giảng viên cụ thể.\nVí dụ trên mô tả một phần nhỏ minh họa CSDL đào tạo của trường đại học bao gồm các thực thể MÔN HỌC, GIẢNG VIÊN, HỌC PHẦN, LỚP HỌC, SINH VIÊN.",
                  "children": []
                },
                {
                  "level_4_title": "1.1.2.2. Tiếp cận CSDL so với tập tin",
                  "level_4_id": "1.1.2.2",
                  "content": "Để hiểu nhu cầu về CSDL, chúng ta hãy xem xét một kịch bản: Một công ty có một bộ sưu tập lớn (ví dụ: 500GB) dữ liệu về nhân viên, phòng ban, sản phẩm, doanh số bán hàng, v.v. Dữ liệu này được truy cập đồng thời bởi một số nhân viên. Các câu hỏi về dữ liệu phải được trả lời nhanh chóng, các thay đổi đối với dữ liệu của những người dùng khác nhau phải được áp dụng nhất quán và quyền truy cập vào các phần nhất định của dữ liệu (ví dụ: tiền lương) phải bị hạn chế. Có thể cố gắng giải quyết vấn đề quản lý dữ liệu này bằng cách lưu trữ dữ liệu trong một bộ sưu tập các tệp hệ điều hành. Cách tiếp cận này có nhiều nhược điểm:\n- Có thể không có bộ nhớ chính 500GB để chứa tất cả dữ liệu. Do đó, chúng ta phải lưu trữ dữ liệu trong một thiết bị lưu trữ ngoài như ổ đĩa hoặc băng từ và đưa các bộ phận liên quan vào bộ nhớ chính để xử lý khi cần thiết.\n- Ngay cả khi chúng ta có 500 GB bộ nhớ chính, trên các hệ thống máy tính có địa chỉ 32 bit, chúng ta không thể tham chiếu trực tiếp đến 4GB dữ liệu. Chúng ta phải lập trình một số phương pháp xác định tất cả các chỉ mục dữ liệu.\n- Chúng ta phải viết các chương trình đặc biệt để giải quyết các vấn đề mà người dùng có thể gặp phải về dữ liệu. Các chương trình này có thể phức tạp vì khối lượng lớn dữ liệu cần tìm kiếm.\n- Chúng ta phải bảo vệ dữ liệu khỏi những thay đổi không đồng nhất do những người dùng khác nhau thực hiện đồng thời kiểm tra dữ liệu. Nếu các chương trình truy cập dữ liệu được viết với tính năng truy cập đồng thời như vậy, điều này làm tăng thêm độ phức tạp của chúng.\n- Chúng ta phải đảm bảo rằng dữ liệu được khôi phục về trạng thái ban đầu nếu hệ thống gặp sự cố trong khi thực hiện các thay đổi.\n- Hệ điều hành chỉ cung cấp một cơ chế mật khẩu để bảo mật. Điều này không đủ linh hoạt để thực thi các chính sách bảo mật trong đó những người dùng khác nhau có nhiệm vụ truy cập các tập con dữ liệu khác nhau.\nTóm lại việc quản lý theo giải pháp hệ thống tệp tin như hình 1.1 có rất nhiều nhược điểm. Thứ nhất, đó là sự dư thừa thông tin: cùng một thông tin được lưu trữ nhiều. Điều đó gây ra việc lãng phí bộ nhớ và dễ gây sai sót trong khi cập nhật dữ liệu, dễ sinh ra các dữ liệu không đúng đắn. Thứ hai, đó là việc phụ thuộc giữa chương trình ứng dụng và dữ liệu. Mỗi khi có sự thay đổi cấu trúc tệp và các dữ liệu trong tệp, chương trình ứng dụng khai thác thông tin trên tệp đó cũng thay đổi theo. Điều đó gây ra khó khăn lớn cho việc bảo trì.\nHệ quản trị CSDL là một phần mềm được thiết kế để làm cho các tác vụ trước đó dễ dàng hơn. Bằng cách lưu trữ dữ liệu trong CSDL, thay vì dưới dạng một tập hợp các tệp hệ điều hành, chúng ta có thể sử dụng các tính năng của Hệ quản trị CSDL để quản lý dữ liệu một cách chặt chẽ và hiệu quả. Việc tiếp cận CSDL được mô tả như ở hình 1.2 có một số các ưu điểm.\nƯu điểm của cơ sở dữ liệu:\n- Giảm sự trùng lặp thông tin xuống mức thấp nhất, do đó bảo đảm được tính nhất quán và toàn vẹn dữ liệu\n- Dữ liệu có thể được truy xuất theo nhiều cách khác nhau\n- Khả năng chia sẻ thông tin cho nhiều người sử dụng và nhiều ứng dụng khác nhau\nĐể đạt được những ưu điểm CSDL đặt ra những vấn đề cần giải quyết, đó là:\nTính chủ quyền của dữ liệu: Do sự chia sẻ của CSDL nên tính chủ quyền của dữ liệu có thể bị lu mờ và làm mờ nhạt tinh thần trách nhiệm, được thể hiện trên vấn đề an toàn dữ liệu, khả năng biểu diễn các mối liên hệ ngữ nghĩa của dữ liệu và tính chính xác của dữ liệu. Nghĩa là người khai thác CSDL phải có nghĩa vụ cập nhật các thông tin mới nhất của CSDL.\nTính bảo mật và quyền khai thác thông tin của người sử dụng: Do có nhiều người cùng khai thác CSDL một cách đồng nên cần phải có một cơ chế bảo mật và phân quyền khai thác CSDL.\nTranh chấp dữ liệu: Nhiều người được phép truy cập vào cùng một tài nguyên dữ liệu nguồn (data source) của CSDL với những mục đích khác nhau như hiển thị, thêm, xóa, sửa dữ liệu. Như vậy cần phải có cơ chế ưu tiên truy nhập dữ liệu cũng như cơ chế giải quyết tình trạng khóa chết trong quá trình khai thác cạnh tranh.Cơ chế ưu tiên có thể được thực hiện dựa trên: Cấp quyền ưu tiên cho người khai thác CSDL, người nào có quyền ưu tiên cao hơn thì được ưu tiên cấp quyền truy nhập dữ liệu trước.Thời điểm truy nhập, ai có yêu cầu truy xuất trước thì có quyền truy nhập dữ liệu trước. Hoặc dựa trên cơ chế lập lịch truy xuất hay cơ chế khoá.\nĐảm bảo dữ liệu khi có sự cố: Việc quản lý tập trung có thể làm tăng khả năng mất mát hoặc sai lệch thông tin khi có sự cố như mất điện đột xuất, một phần hay toàn bộ đĩa lưu trữ dữ liệu bị lỗi... Một số hệ điều hành mạng có cung cấp dịch vụ sao lưu đĩa cứng (cơ chế sử dụng đĩa cứng dự phòng - RAID), tự động kiểm tra và khắc phục lỗi khi có sự cố. Tuy nhiên bên cạnh dịch vụ của hệ điều hành, một CSDL nhất thiết phải có một cơ chế khôi phục dữ liệu khi các sự cố bất ngờ xảy ra để đảm bảo CSDL luôn ổn định.",
                  "children": []
                },
                {
                  "level_4_title": "1.1.2.3. Một số đặc tính của CSDL",
                  "level_4_id": "1.1.2.3",
                  "content": "Bản chất tự mô tả của hệ cơ sở dữ liệu: Một đặc trưng cơ bản của giải pháp cơ sở dữ liệu là hệ thống cơ sở dữ liệu không chỉ gồm có bản thân cơ sở dữ liệu mà còn có cả định nghĩa hoặc mô tả đầy đủ về cấu trúc cơ sở dữ liệu và các ràng buộc. Định nghĩa này được lưu trữ trong từ điển hệ thống, nó chứa các thông tin như là cấu trúc của mỗi tệp, kiểu và dạng lưu trữ của từng mục dữ liệu. Các thông tin được lưu giữ trong từ điển gọi là siêu dữ liệu (metadata) và chúng mô tả cấu trúc của dữ liệu nguyên thuỷ.\nHình 1.3 minh họa bản chất tự mô tả của CSDL. Phần mềm hệ quản trị cơ sở dữ liệu và những người sử dụng cơ sở dữ liệu sử dụng từ điển để lấy thông tin về cấu trúc của cơ sở dữ liệu.\nSự độc lập giữa chương trình và dữ liệu: Trong hệ thống tệp, cấu trúc của các tệp cơ sở dữ liệu được nhúng vào trong các chương trình truy cập, vì vậy bất kỳ một thay đổi nào về cấu trúc của một tệp cũng đòi hỏi phải thay đổi tất cả các chương trình truy cập đến tệp đó. Ngược lại, các chương trình truy cập của hệ quản trị cơ sở dữ liệu không đòi hỏi việc thay đổi như thế. Cấu trúc của các tệp dữ liệu được lưu trữ trong từ điển tách rời với các chương trình truy cập. Tính chất này gọi là sự độc lập dữ liệu – chương trình nó được thể hiện qua hình 1.4.\nHỗ trợ các khung nhìn dữ liệu nhiều thành phần: Một cơ sở dữ liệu có nhiều người sử dụng, mỗi một người có thể đòi hỏi một khung nhìn (view) khác nhau. Một khung nhìn có thể là một tập con của cơ sở dữ liệu hoặc nó có thể chứa các dữ liệu ảo, đó là các dữ liệu được trích ra từ các tệp cơ sở dữ liệu khác nhau nhưng không được lưu trữ một cách rõ ràng. Một hệ quản trị cơ sở dữ liệu nhiều người sử dụng phải cung cấp nhiều công cụ để định nghĩa các khung nhìn nhiều thành phần. Ví dụ như hình 1.6 minh họa tính năng hỗ trợ các khung nhìn dữ liệu nhiều thành phần: cơ sở dữ liệu sinh viên có nhiều người sử dụng, có người thì khai thác SINH VIÊN CHÍNH QUY, có người dùng thì khai thác SINH VIÊN CAO HỌC.\nChia sẻ dữ liệu và nhiều người sử dụng: Một hệ quản trị cơ sở dữ liệu nhiều người sử dụng phải cho phép nhiều người sử dụng truy cập đồng thời đến cơ sở dữ liệu.\nHệ quản trị cơ sở dữ liệu phải có phần mềm kiểm tra cạnh tranh để đảm bảo rằng các người sử dụng cập nhật đến cùng một cơ sở dữ liệu phải được thực hiện theo cách được kiểm tra để cho kết quả của các cập nhật là đúng đắn.",
                  "children": []
                },
                {
                  "level_4_title": "1.1.2.4. Mô hình trừu tượng 3 lớp",
                  "level_4_id": "1.1.2.4",
                  "content": "Mô tả của một CSDL bao gồm một lược đồ ở 3 mức độ trừu tượng: mức vật lý (hay còn gọi là mức trong - physical schema), mức quan niệm (hay còn gọi là mức logic - conceptual schema), mức ngoài (mức khung nhìn – external schema schema). Hình 1.6 mô tả chi tiết 3 mức độ trừu tượng.\nMức ngoài ( Mức khung nhìn): Đó là mức của người sử dụng và các chương trình ứng dụng. Làm việc tại mức này có các nhà chuyên môn, các kỹ sư tin học và những người sử dụng không chuyên. Mỗi người sử dụng hay mỗi chương trình ứng dụng có thể được \"nhìn\" CSDL theo một góc độ khác nhau. Có thể \"nhìn\" thấy toàn bộ hay chỉ một phần hoặc chỉ là các thông tin tổng hợp từ CSDL hiện có. Người sử dụng hay chương trình ứng dụng có thể hoàn toàn không được biết về cấu trúc tổ chức lưu trữ thông tin trong CSDL, thậm chí ngay cả tên gọi của các loại dữ liệu hay tên gọi của các thuộc tính. Họ chỉ có thể làm việc trên một phần CSDL theo cách \"nhìn\" do người quản trị hay chương trình ứng dụng quy định, gọi là khung nhìn (View). Ví dụ 1.7 hỗ trợ 2 khung nhìn “View 1” và “View 2”. “View1”quản lý lương của nhân viên chỉ nhìn thấy các dữ liệu như: sNo, fName, IName, age, salary. “View 2” quản lý nhân viên làm ở chi nhánh nào, nên chỉ nhìn thấy các dữ liệu như: staffNo, IName, branchNo.\nMức quan niệm ( Mức logic): Tại mức này sẽ giải quyết cho câu hỏi CSDL cần phải lưu giữ bao nhiêu loại dữ liệu? đó là những dữ liệu gì? Mối quan hệ giữa các loại dữ liệu này như thế nào? Từ thế giới thực (Real Universe) các chuyên viên tin học qua quá trình khảo sát và phân tích, cùng với những người sẽ đảm nhận vai trò quản trị CSDL, sẽ xác định được những loại thông tin gì được cho là cần thiết phải đưa vào CSDL, đồng thời mô tả rõ mối liên hệ giữa các thông tin này. Có thể nói cách khác, CSDL mức quan niệm là một sự biểu diễn trừu tượng CSDL mức vật lý; hoặc ngược lại, CSDL vật lý là sự cài đặt cụ thể của CSDL mức quan niệm. Ví dụ mô hình quan hệ thực thể mô tả dữ liệu ở mức quan niệm. Trong ví dụ 1.7 ở mức quan niệm tất cả các loại dữ liệu và quan hệ đều được lưu giữ: staffNo, fName, IName, DOB, salary, branchNo.\nMức trong ( Mức vật lý): Đây là mức lưu trữ CSDL. Tại mức này, vấn đề cần giải quyết là, dữ liệu gì và được lưu trữ như thế nào? ở đâu (đĩa từ, băng từ, track, sector ... nào)? Cần các chỉ mục gì? Việc truy xuất là tuần tự (Sequential Access) hay ngẫu nhiên (Random Access) đối với từng loại dữ liệu. Những người hiểu và làm việc với CSDL tại mức này là người quản trị CSDL , những người sử dụng chuyên môn.",
                  "children": []
                }
              ]
            },
            {
              "level_3_title": "1.1.3. Hệ quản trị cơ sở dữ liệu và ưu nhược điểm",
              "level_3_id": "1.1.3",
              "children": [
                {
                  "level_4_title": "1.1.3.1. Định nghĩa hệ quản trị CSDL",
                  "level_4_id": "1.1.3.1",
                  "content": "Để giải quyết tốt những vấn đề đặt ra cho một cơ sở dữ liệu thì cần có một hệ thống các phần mềm, công cụ chuyên dụng hỗ trợ tích cực cho các nhà phân tích, thiết kế và khai thác CSDL. Hệ thống này được gọi là hệ quản trị CSDL (Database Management System - DBMS). Hệ quản trị cơ sở dữ liệu làm đơn giản hóa các thao tác trong quá trình định nghĩa, xây dựng và thao tác cơ sở dữ liệu cho các ứng dụng khác nhau, bao gồm:\n- Định nghĩa - một cơ sở dữ liệu bao gồm việc đặc tả bộ khung dữ liệu cùng với các mô tả chi tiết về dữ liệu và khai báo các ràng buộc cho các dữ liệu sẽ được lưu trữ trong cơ sở.\n- Xây dựng - một cơ sở dữ liệu là quá trình lưu trữ các dữ liệu trên các phương tiện lưu trữ được hệ quản trị cơ sở dữ liệu kiểm soát.\n- Thao tác - một cơ sở dữ liệu bao gồm các chức năng như truy vấn cơ sở dữ liệu để lấy ra các dữ liệu cụ thể, cập nhật cơ sở dữ liệu để phản ánh các thay đổi trong thế giới nhỏ và tạo ra các báo cáo từ các dữ liệu.\n- Chia sẻ - cho phép nhiều người dùng và ứng dụng truy cập đồng thời CSDL\n- Bảo vệ - đảm bảo dữ liệu được lưu trữ an toàn từ các sự cố, ngăn cản truy cập không được phép\nHiện nay có nhiều hệ quản trị CSDL trên thị trường như: Visual Foxpro, SQL server, DB2, Microsoft Access, Oracle... Hệ quản trị cơ sở dữ liệu quan hệ (Relational Database Management System - RDBMS) là một hệ quản trị cơ sở dữ liệu theo mô hình quan hệ.\nCác hệ quản trị cơ sở dữ liệu dùng để thể hiện một cơ sở dữ liệu tin học hoá có thể là phổ dụng (là một phần mềm đóng gói) hoặc có thể là chuyên dụng (là một tập các phần mềm được tạo ra với một mục đích riêng). Hệ thống bao gồm cơ sở dữ liệu và hệ quản trị cơ sở dữ liệu được gọi bằng một thuật ngữ chung là hệ cơ sở dữ liệu. Một hệ cơ sở bao gồm 5 thành phần chính (Phần cứng, CSDL, Hệ quản trị CSDL, Phần mềm ứng dụng, Người dùng), và được mô tả theo lớp như hình vẽ dưới đây:\nVí dụ cơ sở dữ liệu về quản lý đào tạo, cơ sở dữ liệu này lưu giữ các thông tin liên quan đến khóa học, lớp học, sinh viên, giáo viên, môn học,... trong một môi trường đại học hay một hệ cơ sở dữ liệu đào tạo đại học. Ngoài các dữ liệu cơ bản trên, chúng ta cần quan tâm đến thông tin về sinh viên (như thông tin cá nhân, thông tin học tập,...), thông tin về môn học (khối lượng, giáo viên, lịch học,...).\nĐể định nghĩa cơ sở dữ liệu này, chúng ta phải chỉ ra cấu trúc của các bản ghi của mỗi tệp (bảng) bằng cách đặc tả các kiểu khác nhau của các phần tử dữ liệu sẽ được lưu trữ trong mỗi bản ghi. Ví dụ, mỗi bản ghi SINH VIÊN bao gồm các dữ liệu để biểu diễn Mã số sinh viên, Họ tên sinh viên, Giới tính, Địa chỉ. Mỗi bản ghi MÔN HỌC bao gồm các dữ liệu để biểu diễn Tên môn học, Mã số môn học, Số đơn vị học trình, Khoa,... Chúng ta phải chỉ ra một kiểu dữ liệu cho mỗi phần tử dữ liệu bên trong các bản ghi. Ví dụ, ta có thể đặc tả Họ tên sinh viên là một dãy ký tự có độ dài nhỏ hơn hoặc bằng 30, Mã số sinh viên là một số nguyên,....\nĐể xây dựng cơ sở dữ liệu đào tạo này, chúng ta lưu giữ các dữ liệu để biểu diễn mỗi sinh viên, mỗi môn học,... vào các tệp thích hợp. Để ý rằng các bản ghi trong các tệp khác nhau có thể có mối quan hệ với nhau. Ví dụ, bản ghi đối với Nguyễn Quang Hải trong tệp SINH VIÊN có liên quan đến hai bản ghi trong tệp ĐIỂM. Các bản ghi này chỉ ra điểm của Nguyễn Quang Hải trong hai học phần. Tương tự, các bản ghi trong tệp có mối quan hệ với các bản ghi trong tệp MÔN HỌC...Một cơ sở dữ liệu chứa nhiều kiểu bản ghi và chứa nhiều mối quan hệ giữa các tệp. Để có thể lưu trữ được thông tin một cách đa dạng như vậy cần phải có cơ sở dữ liệu hơn là các kiểu lưu trữ tệp truyền thống.\nThao tác cơ sở dữ liệu bao gồm việc truy vấn và cập nhật cơ sở dữ liệu. Truy vấn cơ sở dữ liệu là đưa ra các yêu cầu đối với cơ sở dữ liệu để lấy ra các thông tin cần thiết. Ví dụ, chúng ta có thể có các truy vấn như: “Liệt kê các môn học và điểm thi của sinh viên Nguyễn Quang Hải”, “ Tìm danh sách các sinh viên thi trượt môn cơ sở dữ liệu”. Cập nhật cơ sở dữ liệu bao gồm việc thêm vào cơ sở dữ liệu bản ghi, xóa bỏ các bản ghi hoặc sửa đổi các giá trị trong các bản ghi. Đối với các thông tin cần khai thác cần phải có công cụ hỗ trợ lưu trữ dữ liệu hiệu quả, truy xuất chính xác, điều này được thực hiện bằng phần mềm quản trị CSDL.",
                  "children": []
                },
                {
                  "level_4_title": "1.1.3.2. Các chức năng của hệ quản trị CSDL",
                  "level_4_id": "1.1.3.2",
                  "content": "Lưu trữ các định nghĩa, các mối liên kết dữ liệu (gọi là siêu dữ liệu) vào một từ điển dữ liệu. Các chương trình truy cập đến cơ sở dữ liệu làm việc thông qua hệ quản trị cơ sở dữ liệu. Hệ quản trị cơ sở dữ liệu sử dụng dữ liệu trong từ điển dữ liệu để tìm kiếm các cấu trúc thành phần dữ liệu và các mối liên kết được yêu cầu. Mọi sự thay đổi trong các tệp cơ sở dữ liệu sẽ được tự động ghi lại vào từ điển dữ liệu. Nói cách khác, hệ quản trị cơ sở dữ liệu loại bỏ sự phụ thuộc giữa dữ liệu và cấu trúc ra khỏi hệ thống.\nTạo ra các cấu trúc phức tạp theo yêu cầu lưu trữ dữ liệu, nó giúp người sử dụng làm nhiệm vụ khó khăn là định nghĩa và lập trình cho các đặc trưng vật lý của dữ liệu.\nBiến đổi các dữ liệu được nhập vào để phù hợp với các cấu trúc dữ liệu. Như vậy, hệ quản trị cơ sở dữ liệu giúp người sử dụng phân biệt dạng logic và dạng vật lý của dữ liệu. Bằng việc duy trì sự độc lập dữ liệu, hệ quản trị cơ sở dữ liệu chuyển các yêu cầu logic thành các lệnh định vị một cách vật lý và lấy ra các dữ liệu yêu cầu. Điều đó cũng có nghĩa là hệ quản trị cơ sở dữ liệu tạo khuôn dạng cho các dữ liệu được lấy ra để làm cho nó phù hợp với mong muốn logic của người sử dụng.\nTạo ra một hệ thống bảo mật và áp đặt tính bảo mật và riêng tư trong cơ sở dữ liệu.\nTạo ra các cấu trúc phức tạp cho phép nhiều người sử dụng truy cập đến dữ liệu\nCung cấp các thủ tục sao lưu và phục hồi dữ liệu để đảm bảo sự an toàn và toàn vẹn dữ liệu.\nXúc tiến và áp đặt các quy tắc an toàn để loại bỏ vấn đề toàn vẹn dữ liệu. Điều đó cho phép làm tối thiểu sự dư thừa dữ liệu và làm tối đa tính nhất quán dữ liệu.\nCung cấp việc truy cập dữ liệu thông qua một ngôn ngữ truy vấn. Một ngôn ngữ truy vấn là một ngôn ngữ phi thủ tục cho phép người sử dụng chỉ ra cái gì cần phải làm mà không cần phải chỉ ra nó được làm như thế nào.\nCác hệ quản trị cơ sở dữ liệu cũng cung cấp việc truy cập dữ liệu cho những người lập trình thông qua các ngôn ngữ thủ tục.",
                  "children": []
                },
                {
                  "level_4_title": "1.1.3.3. Các ưu điểm của hệ quản trị CSDL",
                  "level_4_id": "1.1.3.3",
                  "content": "Sử dụng DBMS để quản lý dữ liệu có nhiều ưu điểm :\nĐộc lập dữ liệu: Các chương trình ứng dụng phải độc lập nhất có thể với các chi tiết về biểu diễn và lưu trữ dữ liệu. DBMS có thể cung cấp một chế độ xem trừu tượng của dữ liệu để cách ly mã ứng dụng khỏi các chi tiết đó.\nTruy cập dữ liệu hiệu quả: Hệ quản trị CSDL sử dụng nhiều kỹ thuật phức tạp khác nhau để lưu trữ và truy xuất dữ liệu hiệu quả. Tính năng này đặc biệt quan trọng nếu dữ liệu được lưu trữ trên các thiết bị lưu trữ bên ngoài.\nTính toàn vẹn và bảo mật dữ liệu: Nếu dữ liệu luôn được truy cập thông qua Hệ quản trị CSDL, Hệ quản trị CSDL có thể thực thi các ràng buộc về tính toàn vẹn trong dữ liệu. Ví dụ: trước khi chèn thông tin lương cho một nhân viên, hệ quản trị CSDL có thể kiểm tra xem bộ phận có ngân sách không vượt quá. Ngoài ra, hệ quản trị CSDL có thể thực thi các biện pháp kiểm soát truy cập chi phối dữ liệu nào hiển thị cho các lớp người dùng khác nhau.\nQuản trị dữ liệu: Khi một số người dùng chia sẻ dữ liệu, việc tập trung quản trị dữ liệu có thể mang lại những cải tiến đáng kể. Những chuyên gia giàu kinh nghiệm, những người hiểu bản chất của dữ liệu đang được quản lý và cách các nhóm người dùng khác nhau sử dụng nó, có thể chịu trách nhiệm tổ chức biểu diễn dữ liệu để giảm thiểu dư thừa và tinh chỉnh việc lưu trữ dữ liệu để thực hiện truy xuất hiệu quả.\nTruy cập đồng thời và khôi phục sự cố: Hệ quản trị CSDL lên lịch truy cập đồng thời vào dữ liệu theo cách mà người dùng có thể xem dữ liệu chỉ được truy cập bởi một người dùng tại một thời điểm. Hơn nữa, hệ quản trị CSDL bảo vệ người dùng khỏi ảnh hưởng của lỗi hệ thống.\nGiảm thời gian phát triển ứng dụng: Rõ ràng, hệ quản trị CSDL hỗ trợ nhiều chức năng quan trọng phổ biến đối với nhiều ứng dụng truy cập dữ liệu được lưu trữ trong hệ quản trị CSDL.\nĐiều này, kết hợp với giao diện cấp cao cho dữ liệu, tạo điều kiện phát triển nhanh chóng các ứng dụng.\nCác ứng dụng như vậy cũng có khả năng phát triển hơn các ứng dụng được phát triển từ đầu vì nhiều ứng dụng quan trọng các tác vụ được xử lý bởi hệ quản trị CSDL thay vì được ứng dụng triển khai.\nVới tất cả những ưu điểm này, có lý do gì để không sử dụng hệ quản trị CSDL không? Hệ quản trị CSDL là một phần mềm phức tạp, được tối ưu hóa cho một số loại khối lượng công việc nhất định (ví dụ: trả lời các truy vấn phức tạp hoặc xử lý nhiều yêu cầu đồng thời) và hiệu suất của nó có thể không phù hợp với một số ứng dụng chuyên ngành nhất định. Ví dụ bao gồm các ứng dụng với các ràng buộc thời gian thực chặt chẽ hoặc các ứng dụng chỉ với một vài hoạt động quan trọng được xác định rõ ràng mà mã tùy chỉnh hiệu quả phải được viết. Một lý do khác để không sử dụng hệ quản trị CSDL là một ứng dụng có thể cần phải thao tác với dữ liệu theo những cách không được hỗ trợ bằng ngôn ngữ truy vấn. Trong trường hợp như vậy, chế độ xem trừu tượng của dữ liệu được trình bày bởi hệ quản trị CSDL không phù hợp với nhu cầu của ứng dụng và thực sự cản trở.\nVí dụ, cơ sở dữ liệu quan hệ không hỗ trợ phân tích linh hoạt dữ liệu văn bản (mặc dù các nhà cung cấp hiện đang mở rộng sản phẩm của họ theo hướng này). Nếu hiệu suất chuyên ngành hoặc các yêu cầu thao tác dữ liệu là trọng tâm của một ứng dụng, ứng dụng có thể chọn không sử dụng hệ quản trị CSDL, đặc biệt nếu các lợi ích bổ sung của hệ quản trị CSDL (ví dụ: truy vấn linh hoạt, bảo mật, truy cập đồng thời và khôi phục sự cố) là không cần thiết. Tuy nhiên, trong hầu hết các tình huống yêu cầu quản lý dữ liệu quy mô lớn, hệ quản trị CSDL đã trở thành một công cụ không thể thiếu.",
                  "children": []
                },
                {
                  "level_4_title": "1.1.3.4. Người dùng hệ quản trị CSDL",
                  "level_4_id": "1.1.3.4",
                  "content": "Người thiết kế và cài đặt hệ hệ quản trị CSDL chịu trách nhiệm thiết kế và cài đặt các module của hệ quản trị CSDL và các giao diện dưới hình thức các gói phần mềm.\nNgười phát triển công cụ chịu trách nhiệm thiết kế và cài đặt các gói phần mềm hỗ trợ cho việc thiết kế, sử dụng cũng như tăng cường hiệu năng của các hệ CSDL.\nNgười phân tích hệ thống và phát triển ứng dụng chịu trách nhiệm xác định yêu cầu của người dùng cuối, xác định các giao dịch cần thiết để đáp ứng các yêu cầu người dùng.\nNgười lập trình ứng dụng cài đặt những yêu cầu này trong chương trình, kiểm thử, gỡ rối, lập tài liệu cho chương trình\nNgười thiết kế CSDL chịu trách nhiệm xác định dữ liệu lưu trữ trong CSDL và cấu trúc biểu diễn và lưu trữ những dữ liệu này\nNgười sử dụng cuối là người khai thác các hệ CSDL\nNgười quản trị CSDL chịu trách nhiệm cho phép truy nhập CSDL, điều phối và kiểm tra sử dụng CSDL, quản lý tài nguyên phần cứng và phần mềm khi cần thiết\nNgười bảo trì hệ thống là những người quản trị hệ thống chịu trách nhiệm việc hoạt động và bảo trì môi trường (phần cứng và phần mềm) cho hệ CSDL.",
                  "children": []
                }
              ]
            },
            {
              "level_3_title": "1.1.4. Các ngôn ngữ hệ CSDL",
              "level_3_id": "1.1.4",
              "content": "Một ngôn ngữ con dữ liệu bao gồm hai phần: một ngôn ngữ định nghĩa dữ liệu (Data Definition Language) và một ngôn ngữ thao tác dữ liệu (Data Manipulation Language). Ngôn ngữ định nghĩa dữ liệu được dùng để xác định lược đồ cơ sở dữ liệu chẳng hạn dùng để định nghĩa một quan hệ (một thực thể), các thuộc tính của thực thể đó, các kiểu dữ liệu của mỗi thuộc tính. Ngôn ngữ thao tác dữ liệu được dùng để đọc và cập nhật dữ liệu. Các ngôn ngữ này được gọi là ngôn ngữ con dữ liệu bởi vì chúng không bao gồm các cấu trúc lập trình cần thiết cho việc tính toán như cấu trúc điều kiện hoặc câu lệnh lặp, những cấu trúc được cung cấp bởi các ngôn ngữ lập trình bậc cao. Hầu hết các hệ quản trị cơ sở dữ liệu đều có một môi trường cho phép nhúng các ngôn ngữ con vào ngôn ngữ lập trình mức cao như COBOL, Pascal, C, C++, Java hoặc Visual Basic, những loại ngôn ngữ lập trình bậc cao này được gọi là ngôn ngữ chủ. Hầu hết các ngôn ngữ con cũng cung cấp một phiên bản tương tác hay không nhúng vào ngôn ngữ khác mà được đưa vào trực tiếp từ một thiết bị đầu cuối.\nKhi việc thiết kế cơ sở dữ liệu đã hoàn thành, cần phải chọn một hệ quản trị cơ sở dữ liệu để cài đặt cơ sở dữ liệu. Trong các hệ quản trị cơ sở dữ liệu hiện nay thường có các ngôn ngữ:\nNgôn ngữ định nghĩa dữ liệu (Data Definition Language - DDL): Ngôn ngữ định nghĩa dữ liệu được sử dụng để định nghĩa các lược đồ.\nHệ quản trị cơ sở dữ liệu có một chương trình dịch ngôn ngữ DDL, nhiệm vụ của nó là xử lý các câu lệnh DDL để xác định mô tả của cấu trúc lược đồ và lưu trữ mô tả lược đồ vào từ điển của hệ quản trị cơ sở dữ liệu. Một số câu lệnh trong DDL:\n- Create: Lệnh này được dùng để tạo bảng mới trong database.\n- Drop: Lệnh dùng để xóa cấu trúc và bản ghi được lưu trữ trong bảng.\n- Alter: Lệnh dùng để thay đổi cấu trúc của cơ sở dữ liệu. Các thay đổi này có thể là sửa đổi các đặc điểm của một thuộc tính hoặc thêm một thuộc tính mới.\n- Truncate: Lệnh dùng để xóa các hàng khỏi bảng và giải phóng không gian chứa bảng.\nNgôn ngữ thao tác dữ liệu (Data Manipulation Language - DML): DML là tập hợp các lệnh dùng để sửa đổi cơ sở dữ liệu. Nó chịu trách nhiệm cho các thay đổi về hình thức trong cơ sở dữ liệu. Tất cả các thay đổi không thể lưu vĩnh viễn trong cơ sở dữ liệu. Có nghĩa là chúng ta có thể khôi phục. Một số câu lệnh trong DML:\n- Insert: Đây là câu lệnh truy vấn SQL. Nó được dùng để chèn thêm dữ liệu vào hàng của bảng.\n- Update: Lệnh này dùng để cập nhật hoặc sửa đổi giá trị một cột trong bảng.\n- Delete: Lệnh được dùng để xóa một hoặc nhiều hàng khỏi bảng.\nNgôn ngữ truy vấn: Là một phần quan trọng của ngôn ngữ thao tác dữ liệu liên quan tới việc lấy dữ liệu ra từ cơ sở dữ liệu. Các ngôn ngữ thao tác dữ liệu được phân biệt bởi các cấu trúc lấy dữ liệu bên trong của nó, và được phân chia làm hai loại chính: có thủ tục và không thủ tục. Loại ngôn ngữ thao tác dữ liệu có thủ tục là các ngôn ngữ mà trong đó người dùng có thông báo với hệ thống những dữ liệu nào cần thiết và cách thức chính xác để lấy dữ liệu ra. Loại ngôn ngữ thao tác dữ liệu không có thủ tục là các ngôn ngữ trong đó người dùng chỉ thông báocho hệ thống dữ liệu nào được yêu cầu và để hệ thống tự xác định cách thức lấy dữ liệu đó ra cho người sử dụng. Thông thường thì các ngôn ngữ thao tác dữ liệu có thủ tục sẽ được nhúng vào các ngôn ngữ lập trình mức cao. Các ngôn ngữ thao tác dữ liệu có thủ tục có xu hướng tập trung vào từng bản ghi đơn trong khi loại ngôn ngữ không thủ tục có xu hướng thực hiện trên một tập các bản ghi\nNgôn ngữ điều khiển dữ liệu (Data Control Language - DCL): DCL là tập hợp các lệnh chủ yếu giải quyết các vấn đề liên quan đến quyền, cụ thể là cấp hoặc thu hồi lại quyền của người dùng với cơ sở dữ liệu. Một số câu lệnh trong DCL:\n- Grant: Lệnh được dùng để cấp quyền cho người dùng truy cập vào cơ sở dữ liệu.\n- Revoke: Lệnh được dùng để thu hồi lại quyền truy cập vào cơ sở dữ liệu của người dùng.\nCác ngôn ngữ thế hệ thứ tư : Chúng ta không có khái niệm về cái gì góp phần vào hình thành một ngôn ngữ thế hệ thứ tư. Cảm giác chung nó là một ngôn ngữ lập trình rất nhanh, những yêu cầu được thực hiện với hàng trăm dòng lệnh trong ngôn ngữ thế hệ thứ ba sẽ được hể hiện chỉ trong một vài dòng mã nguồn của ngôn ngữ thế hệ thứ tư. Ngôn ngữ thế hệ thứ ba là thuộc loại thủ tục, trong khi ngôn ngữ thế hệ thứ tư là loại không có thủ tục (đặc tính của không có thủ tục được trình bày rõ ở trên). Loại ngôn ngữ thế hệ thứ tư bao gồm các ngôn ngữ làm việc trên bảng tính và trên cơ sở dữ liệu. SQL (loại ngôn ngữ con dữ liệu được trình bày trong bài giảng ) và QBE là hai ví dụ của ngôn ngữ thế hệ thứ tư.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "1.2. Kiến trúc của một hệ quản trị CSDL",
          "level_2_id": "1.2",
          "content": "Kiến trúc của một hệ quản trị CSDL bao gồm các thành phần chính như sau: phần lưu trữ vật lý (Dữ liệu và siêu dữ liệu), bộ quản lý lưu trữ, bộ quản lý giao dịch, bộ xử lý câu hỏi (bao gồm câu hỏi truy vấn, câu hỏi thay đổi cấu trúc dữ liệu, câu hỏi thay đổi dữ liệu).\nDữ liệu, siêu dữ liệu: Ðáy kiến trúc là thiết bị nhớ ngoài lưu trữ dữ liệu và siêu dữ liệu. Trong phần này không chỉ chứa dữ liệu được lưu trữ trong CSDL mà chứa cả các siêu dữ liệu, tức là thông tin cấu trúc của CSDL. Ví dụ: Trong hệ quản trị cơ sở dữ liệu quan hệ, các siêu dữ liệu bao gồm các tên của các quan hệ, tên các thuộc tính của các quan hệ, và các kiểu dữ liệu đối với các thuộc tính này.\nBộ quản lý lưu trữ: Các CSDL thường đòi hỏi một khối lượng lớn không gian lưu trữ. Do bộ nhớ chính của máy tính không thể lưu trữ nhiều thông tin như vậy, các thông tin này được lưu trữ ở các thiết bị nhớ ngoài như đĩa cứng, đĩa mềm,.v.v... Khi xử lý, dữ liệu cần phải được di chuyển từ đĩa từ vào bộ nhớ chính; sự di chuyển này là khá chậm so với tốc độ xử lý của bộ nhớ trung tâm, do vậy các hệ CSDL phải tổ chức dữ liệu vật lý sao cho tốt, tối thiểu hoá số yêu cầu chuyển dữ liệu giữa đĩa từ vào bộ nhớ chính.\nBộ xử lý câu hỏi: Công việc của bộ xử lý câu hỏi là biến đổi một truy vấn hay một thao tác CSDL có thể được biểu diễn ở các mức cao thành một dãy các yêu cầu đối với các dữ liệu lưu trữ trong CSDL. Thường phần khó nhất của nhiệm vụ xử lý câu hỏi là tối ưu hóa câu hỏi, có nghĩa là lựa chọn một kế hoạch tốt nhất đối với hệ thống lưu trữ để trả lời truy vấn này nhanh nhất.\nBộ xử lý Quản trị giao dịch: Thông thường một số thao tác trên CSDL hình thành một đơn vị logic công việc. Ðiều này có nghĩa là hoặc tất cả các thao tác được thực hiện hoặc không thao tác nào được thực hiện. Hơn nữa sự thực hiện các thao tác này phải đảm bảo tính nhất quán của CSDL. Một giao dịch là một tập hợp các thao tác mà xử lý như một đơn vị không chia cắt được. Các hệ quản trị CSDL điển hình cho phép người sử dụng một hay nhiều nhóm thao tác tra cứu hay thay đổi CSDL thành một giao dịch.",
          "children": []
        },
        {
          "level_2_title": "1.3. Phân loại các hệ CSDL",
          "level_2_id": "1.3",
          "content": "Đặc trưng cơ bản để phân biệt kiến trúc một hệ CSDL là cách tổ chức lưu trữ CSDL và cách tổ chức khai thác, cụ thể là:\n- Những ai sẽ truy cập vào CSDL?\n- Việc truy cập được thực hiện từ đâu?\n- Các mô đun của hệ quản trị CSDL được lưu trữ ở đâu?",
          "children": [
            {
              "level_3_title": "1.3.1. Các hệ cơ sở dữ liệu tập trung",
              "level_3_id": "1.3.1",
              "content": "Với hệ CSDL tập trung, toàn bộ dữ liệu được lưu tại một máy hoặc một dàn máy. Những người dùng từ xa có thể truy cập vào CSDL thông qua các phương tiện truyền thông dữ liệu. Các hệ CSDL tập trung thành 3 loại: Hệ CSDL cá nhân; Hệ CSDL trung tâm; Hệ CSDL khách - chủ.\nHệ CSDL cá nhân: Hệ CSDL cá nhân là hệ CSDL có một người dùng, ví dụ như hình 1.4. Thông thường, người này vừa thiết kế, tạo lập và bảo trì CSDL, đồng thời cũng là người khai thác thông tin, tự lập và hiển thị các báo cáo. Dữ liệu được tập trung ở một máy; Chỉ một người hoặc một nhóm người truy cập theo nguyên tắc lần lượt;\nToàn bộ hệ QTCSDL được lưu ngay tại hệ thống chứa CSDL; Việc truy cập vào CSDL được thực hiện ngay tại hệ thống chứa CSDL.\nHệ CSDL trung tâm: Hệ cơ sở dữ liệu trung tâm là hệ CSDL được cài đặt trên máy tính trung tâm. Dữ liệu được lưu trữ trên máy tính trung tâm.Nhiều người dùng từ xa có thể truy cập CSDL, mô tả chi tiết như hình 1.14.Tùy thuộc vào việc tổ chức: máy tính trung tâm có thể là một máy hay một dàn máy và có rất nhiều người dùng. Việc truy cập thông qua thiết bị đầu cuối và phương tiện truyền thông.\nHệ CSDL khách - chủ: Trong kiến trúc khách - chủ, bộ phận cung cấp tài nguyên được đặt ở máy chủ, bộ phận yêu cầu cấp phát tài nguyên đặt ở máy khách. Hai thành phần này không nhất thiết phải cài đặt trên cùng một máy tính.",
              "children": []
            },
            {
              "level_3_title": "1.3.2. Các hệ cơ sở dữ liệu phân tán",
              "level_3_id": "1.3.2",
              "content": "Các hệ CSDL phân tán: là một tập hợp dữ liệu có liên quan (về logic) được dùng chung và phân tán về mặt vật lý trên một mạng máy tính. Một hệ quản trị CSDL phân tán là một hệ thống phần mềm cho phép quản trị CSDL phân tán và làm cho người sử dụng không nhận thấy sự phân tán về lưu trữ dữ liệu. Người dùng truy cập vào CSDL phân tán thông qua chương trình ứng dụng. Mô tả chi tiết như hình 1.15, khi người dùng có yêu cầu về dữ liệu nó sẽ gửi cho máy chủ, máy chủ kiểm tra và gửi dữ liệu được chọn về cho máy khách.\nMột số ưu điểm của các hệ CSDL phân tán:\n- Cấu trúc phân tán dữ liệu thích hợp cho bản chất phân tán của nhiều người dùng.\n- Dữ liệu được chia sẻ trên mạng nhưng vẫn cho phép quản trị dữ liệu địa phương (dữ liệu đặt tại mỗi trạm)\n- Dữ liệu có tính sẵn sàng cao.\n- Dữ liệu có tính tin cậy cao vì khi một nút gặp sự cố, có thể khôi phục được dữ liệu tại đây do bản sao của nó có thể được lưu trữ tại một nút khác nữa.\n- Hiệu năng của hệ thống được nâng cao hơn.\n- Cho phép mở rộng các tổ chức một cách linh hoạt. Có thể thêm nút mới vào mạng máy tính mà không ảnh hưởng đến hoạt động của các nút sẵn có.\nTuy nhiên hệ CSDL phân tán có một số hạn chế như sau:\n- Hệ thống phức tạp hơn vì phải làm ẩn đi sự phân tán dữ liệu đối với người dùng.\n- Chi phí cao hơn.\n- Đảm bảo an ninh khó khăn hơn.\n- Đảm bảo tính nhất quán dữ liệu khó hơn.\n- Việc thiết kế CSDL phân tán phức tạp hơn.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "1.4. Kết luận chương 1.",
          "level_2_id": "1.4",
          "content": "Nội dung chương 1 của bài giảng giới thiệu tổng quan về lý thuyết cơ sở dữ liệu bao gồm các khái niệm và tính chất đặc trưng của cơ sở dữ liệu, hệ cơ sở dữ liệu, hệ quản trị cơ sở dữ liệu, kiến trúc của hệ quản trị cơ sở dữ liệu và phân loại cơ sở dữ liệu. Mục đích của chương 1 giúp sinh viên nắm được nhược điểm của hệ thống lưu theo file truyền thống; Nắm được các hệ CSDL: khái niệm, khả năng, kiến trúc, người dùng của một hệ quản trị CSDL; Nắm được khái niệm ngôn ngữ cơ sở dữ liệu; Phân tích được các bước thiết kế một cơ sở dữ liệu; Hiểu được một số hệ quản trị cơ sở dữ liệu phổ biến.",
          "children": []
        }
      ]
    },
    {
      "level_1_title": "CHƯƠNG 2. MÔ HÌNH DỮ LIỆU",
      "level_1_id": "2",
      "children": [
        {
          "level_2_title": "2.1. Tổng quan về mô hình dữ liệu",
          "level_2_id": "2.1",
          "content": "Một trong những đặc điểm cơ bản của cơ sở dữ liệu là cung cấp một số mức độ trừu tượng hóa dữ liệu bằng cách làm ẩn đi cách thức tổ chức dữ liệu- cái mà hầu hết người dùng không cần biết đến.\nMô hình dữ liệu (Data Model): Là một tập những khái niệm dùng để biểu diễn cấu trúc của cơ sở dữ liệu-cung cấp những điều kiện cần thiết để đạt được mức độ trừu tượng dữ liệu. Cấu trúc dữ liệu bao gồm kiểu dữ liệu (data types) và mối quan hệ giữa các dữ liệu (relationships) và những ràng buộc (constraints) mà cơ sở dữ liệu phải tuân theo.\nHầu hết mô hình dữ liệu đều có một tập hợp các thao tác cơ bản (basic operations) để truy vấn và cập nhật dữ liệu.\nThao tác chung (generic operations): Thêm (insert), Xóa (delete), Sửa (modify), Truy cập (retrieve)\nThao tác do người dùng định nghĩa (user-defined operations)\nCác loại mô hình cơ sở dữ liệu:\n- Các mô hình dữ liệu bậc cao hoặc mô hình dữ liệu mức quan niệm cung cấp các khái niệm gắn liền với cách cảm nhận dữ liệu của nhiều người sử dụng.\n- Các mô hình dữ liệu bậc thấp hoặc các mô hình dữ liệu vật lý cung cấp các khái niệm mô tả chi tiết về việc dữ liệu được lưu trữ trong máy tính như thế nào\n- Các mô hình dữ liệu thể hiện (mô hình dữ liệu mức logic) cung cấp những khái niệm mà người sử dụng có thể hiểu được, đồng thời không xa với cách tổ chức dữ liệu bên trong máy tính.\n- Mô hình quan hệ là một trong các mô hình dữ liệu mức logic được sử dụng nhiều nhất hiện nay\n- Một số mô hình dữ liệu khác: mô hình dữ liệu đồ thị (graph database model), mô hình dữ liệu địa lý (geographical database model).",
          "children": []
        },
        {
          "level_2_title": "2.2. Mô hình phân cấp",
          "level_2_id": "2.2",
          "content": "Mô hình dữ liệu phân cấp (Hierarchical Data Model), còn gọi là mô hình phân cấp (Hierarchical Model), được thực hiện thông qua sự kết hợp giữa IBM và North American Rockwell vào khoảng năm 1965. Mô hình là một cây, trong đó mỗi nút của cây biểu diễn một thực thể, giữa nút con với nút cha được liên hệ với nhau theo một mối quan hệ xác định. Hình 2.2 mô tả mô hình phân cấp biểu diễn mối quan hệ giữa lớp cha và lớp con của thực thể cha là LOP và GIAO VIEN.\nMột số khái niệm của mô hình phân cấp:\nLoại mẫu tin: Đặc trưng cho một loại đối tượng riêng biệt. Chẳng hạn như trong quản lý nhân sự tại một đơn vị thì đối tượng cần phản ánh của thế giới thực có thể là Phòng, Nhân viên, Công việc, Lý lịch... do đó có các loại mẫu tin đặc trưng cho từng đối tượng này.\nTrong mô hình phân cấp, mỗi loại mẫu tin được thể hiện bằng một hình chữ nhật, một thể hiện (instance) của một loại mẫu tin được gọi là bản ghi (record) .\nLoại mối liên hệ: kiểu liên hệ là phân cấp: Mẫu tin thành viên chỉ đóng vai trò thành viên của một mối liên hệ duy nhất, tức là nó thuộc một chủ duy nhất. Như vậy, mối liên hệ từ mẫu tin chủ tới các mẫu tin thành viên là 1 ÷ n và từ mẫu tin thành viên với mẫu tin chủ là 1 ÷ 1. Giữa hai loại mẫu tin chỉ tồn tại một mối quan hệ duy nhất.\nƯu điểm của mô hình dữ liệu phân cấp:\n- Dễ xây dựng và thao tác\n- Tương thích với các lĩnh vực tổ chức phân cấp\n- Ngôn ngữ thao tác đơn giản: duyệt cây\nNhược điểm mô hình dữ liệu phân cấp:\n- Sự lặp lại của các kiểu bản ghi dữ liệu dư thừa và không nhất quán.\n- Hạn chế trong biểu diễn ngữ nghĩa của các móc nối giữa các bản ghi (chỉ cho phép quan hệ 1-n)",
          "children": []
        },
        {
          "level_2_title": "2.3. Mô hình mạng",
          "level_2_id": "2.3",
          "content": "Mô hình dữ liệu mạng (Network Data Model) hay gọi tắt là mô hình mạng (Network Model) là mô hình được biểu diễn bởi một đồ thị có hướng. Mô hình này được xây dựng bởi Honeywell vào năm 1964-1965. Trong mô hình này, có 3 khái niệm được sử dụng: mẫu tin hay bản ghi (record), loại mẫu tin (record type) và loại liên hệ (set type). Ví dụ hình 2.3 mô tả mối quan hệ giữa các thực thể GIAO VIEN, LOP, MON HOC, SINH VIEN, DIEM THI và các quan hệ theo mô hình mạng.\nLoại mẫu tin: Đặc trưng cho một loại đối tượng riêng biệt. Chẳng hạn như trong quản lý nhân sự tại một đơn vị thì đối tượng cần phản ánh của thế giới thực có thể là Phòng, Nhân viên, Công việc, Lý lịch... do đó có các loại mẫu tin đặc trưng cho từng đối tượng này. Trong mô hình mạng, mỗi loại mẫu tin được thể hiện bằng một hình chữ nhật, một thể hiện (instance) của một loại mẫu tin được gọi là bản ghi (record) . Ở ví dụ trên loại mẫu tin Giảng Viên có các mẫu tin là các giảng viên trong trường, loại mẫu tin Sinh viên có các mẫu tin là các sinh viên đang trong trường đại học...\nLoại liên hệ: Là sự liên kết giữa một loại mẫu tin chủ với một mẫu tin thành viên. Trong mô hình mạng, một loại liên hệ được thể hiện bằng hình bầu dục và sự liên kết giữa hai loại mẫu tin được thể hiện bằng các cung có hướng đi từ loại mẫu tin chủ đến loại liên hệ và từ loại liên hệ đến loại mẫu tin thành viên.\nTrong loại liên kết người ta còn chỉ ra số lượng các mẫu tin tham gia vào trong mối kết hợp. Có một số loại sau:\n- 1÷ 1 (One to One): Mỗi mẫu tin của loại mẫu tin chủ kết hợp với đúng 1 mẫu tin của loại mẫu tin thành viên. Ví dụ, mỗi nhân viên có duy nhất một lý lịch cá nhân.\n- 1÷ n (One to Many): Mỗi mẫu tin của loại mẫu tin chủ kết hợp với 1 hay nhiều mẫu tin của loại mẫu tin thành viên. Ví dụ, mỗi phòng ban có thể có một hoặc nhiều nhân viên.\n- n ÷ 1 (Many to One): Nhiều mẫu tin của loại mẫu tin chủ kết hợp với đúng 1 mẫu tin của loại mẫu tin thành viên. Ví dụ, nhiều nhân viên cùng làm một công việc.\n- Đệ quy (Recursive): Một loại mẫu tin chủ cũng có thể đồng thời là mẫu tin thành viên với chính nó. Ví dụ, trưởng phòng cũng là một nhân viên thuộc phòng trong công ty.\nƯu điểm mô hình dữ liệu mạng:\n- Đơn giản\n- Có thể biểu diễn các ngữ nghĩa đa dạng với kiểu bản ghi và kiểu móc nối\n- Truy vấn thông qua phép duyệt đồ thị\nNhược điểm mô hình dữ liệu mạng:\n- Số lượng các con trỏ lớn.\n- Hạn chế trong biểu diễn ngữ nghĩa của các móc nối giữa các bản ghi",
          "children": []
        },
        {
          "level_2_title": "2.4. Mô hình hướng đối tượng",
          "level_2_id": "2.4",
          "content": "Mô hình dữ liệu hướng đối tượng (Object Oriented Data Model) ra đời vào cuối những năm 80 và đầu những năm 90. Đây là loại mô hình tiên tiến nhất hiện nay dựa trên cách tiếp cận hướng đối tượng. Mô hình này sử dụng các khái niệm như lớp (class), sự kế thừa (inheritance), kế thừa bội (multi - inheritance). Đặc trưng cơ bản của cách tiếp cận này là tính đóng gói (encapsulation), tính đa hình (polymorphism) và tính tái sử dụng (reusability).\nMột số các khái niệm cơ bản:\n- Đối tượng: Một đối tượng trong thế giới thực, được xác định bởi một định danh duy nhất\n- Thuộc tính: Biểu diễn một đặc tính của đối tượng,\n- Phương thức: Thao tác được thực hiện trên đối tượng. Tất cả các truy nhập vào thuộc tính của đối tượng đều phải được thực hiện thông qua các phương thức này.\n- Lớp: Một cách thức để khai báo một tập các đối tượng có chung một tập thuộc tính và phương thức.\nƯu điểm của mô hình hướng đối tượng:\n- Cho phép định nghĩa kiểu đối tượng phức tạp\n- Các tính chất đa dạng: bao đóng (encapsulation), kế thừa (heritage), đa hình (polymorphism)\nNhược điểm mô hình hướng đối tượng:\n- Cấu trúc lưu trữ phức tạp và có thể sử dụng nhiều con trỏ\n- Khả năng tối ưu hoá các xử lý bị hạn chế trong nhiều trường hợp\nBảng 2.1 mô tả đối tượng SINH VIEN bao gồm các thuộc tính như string maSV; tenSV; ngaysinh; nam; diachi;lop;\n\n\nclass sinh_vien\n{\nstring maSV;\nstring tenSV;\ndate ngaysinh;\nboolean nam;\nstring diachi;\nstring lop;\nstring ten();\nstring ngay_sinh();\nstring dia_chi();\nstring lop();\nvoid gan_DC(string DC_moi);\nvoid gan_lop(string lop);\n}\n",
          "children": []
        },
        {
          "level_2_title": "2.5. Mô hình thực thể kết hợp",
          "level_2_id": "2.5",
          "children": [
            {
              "level_3_title": "2.5.1. Các bước của quá trình thiết kế",
              "level_3_id": "2.5.1",
              "content": "Quá trình thiết kế và cài đặt cơ sở dữ liệu được mô tả như hình 2.4.\nBước 1. Phân tích yêu cầu của bài toán: Bước đầu tiên là tập hợp các yêu cầu và phân tích. Trong bước này, người thiết kế cơ sở dữ liệu phỏng vấn những người sử dụng cơ sở dữ liệu để hiểu và làm tài liệu về các yêu cầu dữ liệu của họ. Kết quả của bước này là một tập hợp ghi chép chi tiết các yêu cầu của những người sử dụng. Những yêu cầu sẽ được đặc tả đầy đủ và chi tiết càng tốt.\nSong song với việc đặc tả các yêu cầu dữ liệu, cần phải đặc tả các yêu cầu về chức năng của ứng dụng: đó là các thao tác do người sử dụng định nghĩa sẽ được áp dụng đối với cơ sở dữ liệu.\nBước 2. Thiết kế cơ sở dữ liệu mức khái niệm: Khi tất cả các yêu cầu đã được thu thập và phân tích, bước tiếp theo là tạo ra lược đồ quan niệm cho cơ sở dữ liệu bằng cách sử dụng mô hình dữ liệu quan niệm mức cao. Bước này gọi là thiết kế quan niệm. Lược đồ quan niệm bao gồm các mô tả chi tiết của các kiểu thực thể, kiểu liên kết và các ràng buộc, chúng được biểu diễn bằng các khái niệm do các mô hình dữ liệu bậc cao cung cấp. Trong quá trình (hoặc sau khi) thiết kế lược đồ quan niệm, chúng ta có thể sử dụng các phép toán cơ bản của mô hình dữ liệu để đặc tả các thao tác của người sử dụng được xác định trong khi phân tích chức năng. Điều đó cũng giúp khẳng định rằng lược đồ quan niệm thỏa mãn mọi yêu cầu chức năng được xác định. Nếu có một số yêu cầu chức năng không thể nêu ra được trong lược đồ ban đầu thì ở bước này có thể có sự sửa đổi lược đồ quan niệm cho phù hợp.\nBước 3. Thiết kế cơ sở dữ liệu ở mức logic: Bước tiếp theo trong việc thiết kế cơ sở dữ liệu là việc cài đặt một cơ sở dữ liệu bằng cách sử dụng một hệ quản trị cơ sở dữ liệu có sẵn. Hầu hết các hệ quản trị cơ sở dữ liệu sử dụng một mô hình dữ liệu cài đặt (thể hiện), chẳng hạn như mô hình quan hệ hoặc đối tượng, vì vậy lược đồ quan niệm được chuyển từ mô hình dữ liệu bậc cao thành mô hình dữ liệu cài đặt. Bước này gọi là thiết kế logic hoặc là ánh xạ mô hình dữ liệu. Kết quả của bước này là một lược đồ cơ sở dữ liệu dưới dạng một mô hình dữ liệu cài đặt của hệ quản trị cơ sở dữ liệu.\nBước 4. Cải thiện các lược đồ: Ở bước 4 các lược đồ được phát triển ở bước 3 được phân tích để phát hiện ra các vấn đề tiềm ẩn. Tại bước này, các lược đồ sẽ được chuẩn hóa. Việc chuẩn hóa một cơ sở dữ liệu dựa trên lý thuyết toán học và được trình bày chi tiết ở chương 4.\nBước 5. Thiết kế cơ sở dữ liệu vật lý: Trong bước này ta phải chỉ ra các cấu trúc bên trong, các đường dẫn truy cập, tổ chức tệp cho các tệp cơ sở dữ liệu. Song song với các hoạt động đó, các chương trình ứng dụng cũng được thiết kế và cài đặt như là các giao tác (transaction) cơ sở dữ liệu tương ứng với các đặc tả giao tác mức cao.\nBước 6.Thiết kế an toàn bảo mật cho hệ thống: Các nhóm người dùng khác nhau được xác định và các vai trò khác nhau của họ được phân tích sao cho cách thức truy nhập tới dữ liệu có thể xác định được.\nThông thường quá trình phát triển sẽ có bước thứ bảy hay là bước cuối cùng, được gọi là giai đoạn chuốt lại hệ thống. Trong giai đoạn này, hệ thống cơ sở dữ liệu sẽ được thực hiện (mặc dù có thể nó chỉ được chạy trên chế độ mô phỏng) và sẽ được trau chuốt, cải thiện để đáp ứng được nhu cầu thực thi trong môi trường mong đợi.",
              "children": []
            },
            {
              "level_3_title": "2.5.2. Các khái niệm cơ bản",
              "level_3_id": "2.5.2",
              "content": "Mô hình dữ liệu thực thể kết hợp (E-R - entity-relationship data model) do Peter Pin Shan Chen đề xuất năm 1976, Ông nhìn thế giới thực như là một tập các đối tượng căn bản được gọi là các thực thể và các mối quan hệ giữa các đối tượng này.\nMô hình đã được phát triển để làm thuận tiện cho việc thiết kế cơ sở dữ liệu bằng cách đặc tả một tổ chức.\nMục tiêu của mô hình E-R trong quá trình thiết kế cơ sở dữ liệu đó là phân tích dữ liệu, xác định các đơn vị thông tin cơ bản cần thiết của tổ chức, mô tả cấu trúc và mối liên hệ giữa chúng.\nE-R là mô hình trung gian để chuyển những yêu cầu quản lý dữ liệu trong thế giới thực thành mô hình cơ sở dữ liệu quan hệ. Một lược đồ như vậy biểu diễn một cấu trúc logic tổng quát của cơ sở dữ liệu. Mô hình E-R:\n- Cho phép mô tả các dữ liệu có liên quan trong thế giới thực dưới dạng các đối tượng và các mối quan hệ của chúng.\n- Được sử dụng cho bước đầu thiết kế CSDL, làm nền tảng để ánh xạ sang một mô hình nào đó mà hệ quản trị CSDL sẽ sử dụng\n- Những khái niệm mà mô hình E-R dùng: thực thể, tập thực thể, khóa, mối quan hệ, và thuộc tính. Hình 2.5 mô tả các ký hiệu được dùng để mô tả thực thể, thực thể yếu và các thuộc tính. Hình vẽ 2.6 mô tả các mối liên kết và các ràng buộc về tỷ số lực lượng giữa các thực thể. Các ký hiệu trong hình vẽ minh họa sơ đồ ER theo ký hiệu của Peter Chen (Peter Chen là tác giả của mô hình thực thể-liên kết-1976). Ngoài ra còn có sơ đồ ER theo ký hiệu \"chân chim\" (crow’s foot) do Gordon Everest là người đề xuất sử dụng ký hiệu \"chân chim\" trong mô hình ER (1976). Tuy nhiên trong phạm vi bài giảng chỉ sử dụng ký hiệu của Peter Chen.\nMột số ví dụ về lược đồ E-R (ERD) được thể hiện trong hình vẽ dưới đây:\nTình huống 1: Trong cuộc thi Robocon được tổ chức bởi Học viện Công nghệ Bưu chính Viễn thông, có nhiều trường cùng tham gia thi. Mỗi trường tham gia thi sẽ cử đại diện là các đội thi. Trong mỗi đội thi có các thành viên. Đối với mỗi trường, cần lưu mã trường, tên trường, tỉnh thành. Đối với mỗi đội thi, cần lưu tên đội (duy nhất trong từng trường). Mỗi thành viên trong đội có mã số (do ban tổ chức cấp và là duy nhất trong toàn cuộc thi), tên, và ngày sinh. Ngoài ra, mỗi đội có một người đội trưởng cũng là thành viên trong đội. Hình 2.7 thể hiện lược đồ E-R theo đặc tả của tình huống 1.\nTình huống 2: Học viện Công nghệ Bưu chính Viễn thông có nhiều tòa nhà. Mỗi tòa nhà được đặt một tên duy nhất. Mỗi tòa nhà bao gồm nhiều phòng. Mỗi phòng có các thông tin: số phòng, chức năng, chiều dài, chiều rộng. Số phòng của các phòng trong cùng một tòa nhà thì khác nhau nhưng số phòng giữa các phòng của những tòa nhà khác nhau thì có thể giống nhau. Để thuận tiện cho việc quản lý cơ sở dữ liệu cần lưu trữ thêm diện tích của mỗi phòng và năm xây dựng của mỗi tòa nhà. Mỗi phòng sẽ có thể có một số vật tư. Thông tin về vật tư cần lưu là: mã số, tên và mô tả. Hình 2.8 thể hiện lược đồ E-R theo đặc tả của tình huống 2.",
              "children": [
                {
                  "level_4_title": "2.5.2.1. Thực thể - Tập thực thể",
                  "level_4_id": "2.5.2.1",
                  "content": "Một thực thể là một “sự vật” hoặc “đối tượng” mà nó tồn tại và có thể phân biệt được với các đối tượng khác. Ví dụ như một nhân viên trong một tổ chức là một thực thể.\nMột tập thực thể là một tập hợp các thực thể cùng loại mà chúng có chung những tính chất hoặc thuộc tính. Ví dụ như tập hợp tất cả những người mà họ là nhân viên của một tổ chức là một tập thực thể khách hàng. Mỗi tập thực thể được đặt một tên gọi, thông thường là danh từ. Ví dụ như KHACHHANG, HOADON,...Ký hiệu: hình chữ nhật với tên gọi của thực thể như hình 2.9 mô tả tập thực thể NHAN_VIEN\nVí dụ: Quản lý các dự án của công ty\n- Một nhân viên là một thực thể\n- Tập hợp các nhân viên là tập thực thể\n- Một dự án là một thực thể\n- Tập hợp các dự án là tập thực thể\n- Một phòng ban là một thực thể\n- Tập hợp các phòng ban là tập thực thể",
                  "children": []
                },
                {
                  "level_4_title": "2.5.2.2. Thuộc tính",
                  "level_4_id": "2.5.2.2",
                  "content": "Mỗi tập thực thể có một tập các tính chất đặc trưng, mỗi tính chất đặc trưng này gọi là thuộc tính của tập thực thể. Ứng với mỗi thuộc tính có một tập các giá trị cho thuộc tính đó gọi là miền giá trị. Ký hiệu: hình oval với tên gọi, có đường nối với thực thể như mô tả trong hình 2.10.\nMiền giá trị của các thuộc tính: Mỗi thuộc tính đơn của một kiểu thực thể được kết hợp với một miền giá trị. Đó là một tập các giá trị có thể gán cho thuộc tính này đối với mỗi thực thể riêng biệt. Các miền giá trị không hiển thị trong các sơ đồ ER. Một cách toán học, một thuộc tính A của kiểu thực thể E có tập giá trị V có thể được định nghĩa như là một hàm từ E vào tập hợp lực lượng P(V) của V:\nA: E → P(V)\nTa ký hiệu giá trị của thuộc tính A đối với thực thể e là A(e). Định nghĩa ở trên đúng cho các thuộc tính đơn trị, đa trị và thuộc tính không xác định. Một giá trị không xác định được biểu diễn bằng một tập rỗng. Với các thuộc tính đơn trị, A(e) là một giá trị đơn cho thực thể e. Các thuộc tính đa trị không có các hạn chế trên A(e).\nVới một thuộc tính phức hợp A, tập giá trị V là tích Đề các của P(V1) x P(V2) x ... x P(Vn), trong đó V1, V2, ..., Vn là tập các giá trị cho các thành phần đơn của A.\nCác kiểu trong miền giá trị của thuộc tính bao gồm:\n- Kiểu chuỗi (varchar, char,..)\n- Kiểu số nguyên (int,)\n- Kiểu số thực (numeric,..)...\nVí dụ tập thực thể SINHVIEN có các thuộc tính:\n- Họ tên (hoten: string[20])\n- Ngày sinh (ns: date)\n- Điểm TB (DTB:float)\nThuộc tính đơn, kết hợp: Thuộc tính đơn là thuộc tính không thể chia ra thành những phần con nhỏ hơn. Còn thuộc tính kết hợp thì có thể chia ra thành những phần con (tức là thành những thuộc tính khác). Ví dụ thuộc tính ĐỊA CHỈ ở trong hình 2.12 của tập thực thể GIÁO VIÊN có thể chia nhỏ thành các thành phần: SoNha, TenDuong, Quan, ThanhPho. Hình 2.11 mô tả các thuộc tính đơn của thực thể SINH_VIEN bao gồm: MaSV, TenSV, NamSinh, GioiTinh.\nThuộc tính đa giá trị: Tương ứng với mỗi thực thể, có thể nhận nhiều giá trị. Ví dụ: thuộc tính DienThoai trong hình 2.13 của tập thực thể GIAO_VIEN là thuộc tính đa trị mô tả mỗi giáo viên có thể có nhiều số điện thoại.\nThuộc tính suy diễn: Giá trị của loại thuộc tính này có thể được suy ra từ các thuộc tính hoặc thực thể liên hệ khác. Ví dụ từ thuộc tính Ngày sinh có thể suy ra thuộc tính tuổi (Ngày sinh <----> tuổi), dùng hình oval nét đứt và Tên thuộc tính để mô tả thuộc tính suy diễn. Hình 2.14 thuộc tính tuổi là thuộc tính suy diễn, nó được suy ra từ thuộc tính NamSinh.\nThuộc tính khóa của một kiểu thực thể: Một ràng buộc quan trọng trên các thực thể của một kiểu thực thể là khóa. Một kiểu thực thể thường có một thuộc tính mà các giá trị của nó là khác nhau đối với mỗi thực thể riêng biệt trong một tập thực thể. Thuộc tính như vậy gọi là thuộc tính khóa và các giá trị của nó có thể dùng để xác định từng thực thể một cách duy nhất. Ví dụ, thuộc tính MaSV của kiểu thực thể SINH_VIEN trong hình 2.15 là khóa của kiểu thực thể đó vì mỗi thực thể sinh viên có một mã duy nhất. Đôi khi, nhiều thuộc tính kết hợp với nhau tạo thành một khóa, nghĩa là tổ hợp các giá trị của các thuộc tính này phải khác nhau đối với mỗi thực thể. Trong trường hợp như vậy ta có một thuộc tính khóa phức hợp. Trong lược đồ của mô hình ER, thuộc tính khóa được biểu diễn bằng cách gạch ngang dưới tên của nó.",
                  "children": []
                },
                {
                  "level_4_title": "2.5.2.3. Kiểu liên kết, tập liên kết và các thể hiện",
                  "level_4_id": "2.5.2.3",
                  "content": "Một kiểu liên kết R giữa n kiểu thực thể E1, E2, ..., En xác định một tập liên kết giữa các thực thể của các kiểu đó. Cũng như các kiểu thực thể và tập thực thể, một kiểu liên kết và tập liên kết tương ứng với nó cũng có tên chung là R. Một cách toán học, tập liên kết R là một tập hợp các thể hiện liên kết ri , i= 1, 2 ,... trong đó mỗi ri liên kết n thực thể riêng biệt e1, e2, ..., en và mỗi một thực thể ej trong ri là một thành phần của kiểu thực thể Ej , 1≤ j ≤ n. Như vậy, một kiểu liên kết R là một quan hệ toán học trên E1, E2, ..., En hoặc có thể định nghĩa như là một tập con của tích Đề các E1 x E2 x ...x En. Mỗi kiểu thực thể E1,E2,....,En được gọi là tham gia vào kiểu liên kết R, và tương tự, mỗi thực thể riêng biệt e1, e2, ..., en được gọi là tham gia vào thể hiện liên kết ri = (e1, e2, ..., en). Một cách không hình thức, mỗi thể hiện liên kết ri trong R là một sự kết hợp của các thực thể, mỗi thực thể thuộc về một kiểu thực thể tham gia vào liên kết. Mỗi liên kết ri như vậy diễn đạt một sự kiện rằng các thực thể tham gia trong ri có mối quan hệ với nhau theo một cách nào đó ở trong thế giới thực.\nVí dụ, trong thực tế, các nhân viên Làm_Việc ở Phòng_Ban, như vậy, có một kiểu liên kết liên kết Làm_Việc, liên kết giữa kiểu thực thể Nhân_Viên và kiểu thực thể Phòng_Ban. Trong sơ đồ ER, kiểu liên kết được biểu diễn bằng một hình thoi nối trực tiếp với các hình chữ nhật biểu diễn các kiểu thực thể tham gia vào liên kết. Kiểu liên kết có thể có nhiều thuộc tính: Thuộc tính kể_từ_khi của kiểu liên kết Làm_Việc.\nCó thể có nhiều kiểu liên kết giữa cùng các kiểu thực thể\nVí dụ hình 2.18 giữa các kiểu thực thể NHANVIEN và PHONGBAN có 2 mối liên kết là LAMVIEC và QUANLY.\nBậc của kiểu liên kết: Số lượng kiểu thực thể tham gia vào liên kết.\nCác loại mối quan hệ (relationship type)\n- Mối quan hệ 1 ngôi: Là mối quan hệ giữa các thể hiện của cùng một thực thể. Còn gọi là mối quan hệ đệ quy (Recursive Relationship). Đôi khi một thực thể xuất hiện nhiều hơn 1 lần trong mối quan hệ. Để phân biệt, nên cho biết vai trò trên các cạnh nối giữa mối quan hệ và thực thể.\n- Mối quan hệ 2 ngôi: Là mối quan hệ giữa hai kiểu thực thể. Ví dụ trong hình 2.20 mối quan hệ DIEM_THI liên kết giữa 2 kiểu thực thể SINH_VIEN và MON_HOC\n- Mối quan hệ 3 ngôi: Là mối quan hệ giữa 3 kiểu thực thể. Ví dụ trong hình 2.21 mối quan hệ DIEM_THI liên kết giữa 3 kiểu thực thể SINH_VIEN, MON_HOC và GIAO_VIEN.",
                  "children": []
                },
                {
                  "level_4_title": "2.5.2.4. Ràng buộc trên các kiểu liên kết",
                  "level_4_id": "2.5.2.4",
                  "content": "Các ràng buộc được xác định từ thế giới thực. Ví dụ như:\n- 1 nhân viên chỉ được làm việc trong 1 phòng ban.\n- 1 phòng ban phải có 1 trưởng phòng.\nLực lượng tối đa của liên kết: Số lượng tối đa các liên kết mà một thực thể có thể tham gia.\nLực lượng tối thiểu của liên kết: Số lượng tối thiểu các liên kết mà một thực thể có thể tham gia.\nRàng buộc về tỉ lệ lực lượng đối với mối quan hệ 2 ngôi : Tỉ số lực lượng tối đa của 2 kiểu thực thể tham gia vào liên kết có 3 loại: 1:N, 1:1 và M:N.\nRàng buộc về sự tham gia: Lực lượng tối thiểu của liên kết. Có 2 loại: tham gia bắt buộc và tham gia không bắt buộc.\n- Liên kết 1-1: Là liên kết mà mỗi thực thể loại 1 chỉ có thể có quan hệ với không quá 1 thực thể loại 2, và ngược lại. Ràng buộc 1-1 gọi là lực lượng của liên kết. Ví dụ hình 2.22 một giáo viên chỉ chủ nhiệm 1 lớp và 1 lớp cũng chỉ có 1 giáo viên chủ nhiệm.\nVí dụ:\n- Liên kết 1-n: Mỗi thực thể loại 1 có thể có liên kết với nhiều thực thể loại 2, nhưng mỗi thực thể loại 2 chỉ có thể có quan hệ với nhiều nhất 1 thực thể loại 1\nVí dụ:\nVí dụ hình 2.25 một lớp bao gồm nhiều SINH_VIEN, nhưng 1 SINH_VIEN chỉ nằm trong 1 lớp.\nLiên kết n-n: Liên kết 1 thực thể của một tập thực thể với nhiều thực thể của tập thực thể khác và ngược lại\nVí dụ hình 2.27 mô tả 1 SINH_VIEN có thể DANG_KY nhiều MON_HOC, ngược lại 1 MON_HOC có thể được DANG_KY bởi nhiều SINH_VIEN.\nThuộc tính của liên kết: Liên kết cũng có thể có thuộc tính, tương tự như của thực thể. Thực chất là việc chuyển một tập thực thể trong liên kết thành thuộc tính. Ví dụ hình 2.28 liên kết DIEM_THI có thuộc tính là KetQua.\nHình 2.29 mô tả các ràng buộc về tỷ số lực lượng trên các kiểu liên kết.\n- Một đơn vị chỉ có duy nhất 1 người làm quản lý và 1 NHÂNVIÊN chỉ làm Quản lý cho 1 ĐƠNVỊ, được thể hiện qua liên kết Quản lý ( 1-1)\n- Một ĐƠN VỊ có nhiều NHÂN VIÊN làm việc, 1 NHÂNVIÊN chỉ làm việc ở 1 ĐƠN VỊ , được thể hiện quan liên kết Làm việc cho (1-n)\n- Một NHÂN VIÊN có thể làm việc trên nhiều dự án và 1 DỰ ÁN có thể có nhiều NHÂN VIÊN làm việc, được thể hiện qua liên kết Làm việc trên (m-n).",
                  "children": []
                },
                {
                  "level_4_title": "2.5.2.5. Tập thực thể yếu (Weak Entity)",
                  "level_4_id": "2.5.2.5",
                  "content": "Tập thực thể yếu (Weak Entity): Một tập thực thể có thể không có đủ các thuộc tính để cấu thành một khóa chính, được gọi là tập thực thể yếu. Một tập thực thể mà nó có khóa chính được gọi là tập thực thể mạnh. Tập thực thể yếu phải tham gia vào mối quan hệ mà trong đó có một tập thực thể mạnh (tập thực thể mà tập thực thể yếu phụ thuộc).\nVí dụ: Trong đơn hàng thực tế, CHI TIẾT ĐƠN HÀNG là thực thể yếu; ĐƠN HÀNG là thực thể định danh của CHI TIẾT ĐƠN HÀNG; Thuộc là liên kết định danh. CHI TIẾT ĐƠN HÀNG không có khoá từ các thuộc tính của nó: Khoá được xác định: STT + SO DH ( ĐƠN HÀNG); CHI TIẾT ĐƠN HÀNG phụ thuộc tồn tại vào ĐƠN HÀNG.\nTrong một công ty, con của nhân viên và nhân viên có thể hưởng chế độ bảo hiểm theo nhân viên. Như vậy, sẽ có một kiểu liên kết NHÂN VIÊN có CON. Đây là một kiểu liên kết 1:N. Các thuộc tính của kiểu thực thể CON là Họ Tên, Ngày sinh, Giới Tính. Hai người con của hai nhân viên khác nhau có thể có cùng giá trị cho các thuộc tính nhưng nó là hai thực thể khác nhau. Chỉ được xác định như hai thực thể khác nhau sau khi xác định một thực thể nhân viên cụ thể có liên quan đến từng người phụ thuộc.\nHình 2.33 THAN NHAN chỉ được quản lý như là một phần thông tin bổ sung cho NHAN VIEN . Công ty không có nhu cầu quản lý mã số cho thân nhân, khoá của THAN NHAN được xác định: Tên (THAN NHAN)+ MãNV (NHAN VIEN)",
                  "children": []
                }
              ]
            },
            {
              "level_3_title": "2.5.3. Các bước xây dựng mô hình ER",
              "level_3_id": "2.5.3",
              "content": "Bước 1: Xác định các kiểu thực thể\nBước 2: Xác định các kiểu liên kết\nBước 3: Xác định các thuộc tính của các kiểu thực thể và các mối liên kết\nBước 4: Vẽ sơ đồ ER\nVí dụ 1: Học viện công nghệ Bưu chính Viễn thông có nhiều tòa nhà. Mỗi tòa nhà được đặt một tên duy nhất. Mỗi tòa nhà bao gồm nhiều phòng. Mỗi phòng có các thông tin: số phòng, chức năng, chiều dài, chiều rộng. Số phòng của các phòng trong cùng một tòa nhà thì khác nhau nhưng số phòng giữa các phòng của những tòa nhà khác nhau thì có thể giống nhau. Để thuận tiện cho việc quản lý cơ sở dữ liệu cần lưu trữ thêm diện tích của mỗi phòng và năm xây dựng của mỗi tòa nhà. Mỗi phòng sẽ có thể có một số vật tư. Thông tin về vật tư cần lưu là: mã số, tên và mô tả.\nBước 1: Xác định kiểu thực thể\nTÒA NHÀ là thực thể mạnh: độc lập với các thực thể còn lại.\nPHÒNG là thực thể yếu: phụ thuộc vào thực thể TÒA NHÀ.\nVẬT TƯ là thực thể mạnh: độc lập với các thực thể còn lại.\nBước 2: Xác định các kiểu liên kết\nBước 3: Xác định thuộc tính của kiểu thực thể\nTÒA NHÀ: Ten, Nam Xay.\nPHÒNG: Số phòng, chức năng, chiều dài, chiều rộng, diện tích.\nVẬT TƯ: Mã Số, Tên, Mô tả.\nBước 4: Vẽ sơ đồ ER\nVí dụ 2: Phân tích và thiết kế 1 CSDL gồm các thông tin trong 1 công ty (nhân viên, phòng ban, dự án)\n- Công ty được tổ chức bởi các phòng ban. Mỗi phòng ban có 1 tên duy nhất, 1 số duy nhất và 1 người quản lý (thời điểm bắt đầu công tác quản lý của người này cũng được lưu lại trong CSDL). Mỗi phòng ban có thể có nhiều trụ sở làm việc khác nhau\n- Mỗi phòng điều phối một số dự án. Mỗi dự án có 1 tên và 1 mã số duy nhất, thực hiện tại một địa điểm duy nhất\n- Các thông tin về nhân viên cần được quan tâm gồm: tên, số bảo hiểm, địa chỉ, lương, giới tính, ngày sinh. Mỗi nhân viên làm việc tại một phòng ban nhưng có thể tham gia nhiều dự án khác nhau. Những dự án này có thể được điều phối bởi các phòng ban khác nhau. Thông tin về số giờ làm việc trong từng dự án (theo tuần) cũng như người quản lý trực tiếp của các nhân viên cũng được lưu trữ.\n- Thông tin về con cái của từng nhân viên: tên, giới tính, ngày sinh",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "2.6. Mô hình quan hệ",
          "level_2_id": "2.6",
          "content": "Mô hình quan hệ được Ted Codd đưa ra đầu tiên vào năm 1970 và gây được chú ý ngay tức khắc vì tính đơn giản và các cơ sở toán học của nó. Mô hình quan hệ sử dụng khái niệm quan hệ toán học như là khối xây dựng cơ sở và có cơ sở lý thuyết của nó trong lý thuyết tập hợp và logic vị từ bậc nhất.",
          "children": [
            {
              "level_3_title": "2.6.1. Các khái niệm cơ bản",
              "level_3_id": "2.6.1",
              "content": "Mô hình quan hệ biểu thị cơ sở dữ liệu như một tập các quan hệ. Mối quan hệ có thể được biểu diễn như một bảng giá trị, mỗi một dòng trong bảng biểu thị một tập hợp các giá trị dữ liệu liên quan với nhau. Trong mô hình quan hệ, mỗi một dòng trong bảng biểu thị một sự kiện tương ứng với một thực thể hoặc một liên kết của thế giới thực. Tên bảng và tên các cột dùng để giúp giải thích ý nghĩa của các giá trị trong mỗi hàng. Mọi giá trị trong một cột đều cùng một kiểu dữ liệu.\nTheo thuật ngữ mô hình quan hệ hình thức, mỗi hàng được gọi là một bộ, mỗi đầu cột được gọi là một thuộc tính, và bảng được gọi là một quan hệ. Kiểu dữ liệu mô tả các kiểu của dữ liệu xuất hiện trong mỗi cột gọi là một miền giá trị. Miền, thuộc tính, bộ và quan hệ\nMột miền D là một tập hợp các giá trị nguyên tố, điều đó có nghĩa là mỗi giá trị trong miền là không thể phân chia được trong phạm vi mô hình quan hệ. Để đặc tả một miền, người ta chỉ ra một tên, một kiểu dữ liệu và khuôn dạng dữ liệu. Ngoài ra, trong cơ sở dữ liệu người ta còn chỉ ra các thông tin phụ để thể hiện các giá trị của miền, chẳng hạn các đơn vị tính như tiền, trọng lượng,...ví dụ:\nMiền D1: kiểu dữ liệu số nguyên có dấu 16 bit\nMiền D2: kiểu dữ liệu nhãn thời gian (timestamp: 2020-03-07 10:01:30)\nMiền D3: kiểu dữ liệu chuỗi ký tự có độ dài nhỏ hơn 32\nThuộc tính: Thuộc tính (attribute) là một tính chất riêng biệt của một đối tượng cần được lưu trữ trong CSDL để phục vụ cho việc khai thác dữ liệu về đối tượng.\nVí dụ:\n- Đối tượng LOPHOC có các thuộc tính mã lớp, tên lớp, khóa, số học viên.\n- Đối tượng SINHVIEN có các thuộc tính mã sinh viên, họ tên, ngày sinh, quê quán.\nCác thuộc tính được đặc trưng bởi một tên thuộc tính, kiểu giá trị (data type) và miền giá trị (domain). Trong các ứng dụng thực tế, người phân tích – thiết kế thường đặt tên thuộc tính một cách gợi nhớ, tuy nhiên không nên đặt tên quá dài (vì làm cho việc viết câu lệnh truy vấn vất vả hơn) nhưng cũng không nên quá ngắn (vì không thể hiện được ngữ nghĩa một cách rõ ràng).\nVí dụ: nếu có hai đối tượng SINH VIÊN và GIÁO VIÊN đều có thuộc tính tên thì nên đặt tên một cách rõ ràng là Tên_sinh_viên và Tên_giáo_viên vì chúng mang ngữ nghĩa hoàn toàn khác nhau. Mỗi một thuộc tính đều phải thuộc một kiểu dữ liệu. Kiểu dữ liệu có thể là vô hướng - là các kiểu dữ liệu cơ bản như chuỗi, số, logic, ngày tháng... hoặc các kiểu có cấu trúc được định nghĩa dựa trên các kiểu dữ liệu đã có sẵn.\nMỗi hệ quản trị CSDL có thể gọi tên các kiểu dữ liệu nói trên bằng các tên gọi khác nhau, ngoài ra còn bổ sung thêm một số kiểu dữ liệu riêng của mình. Ví dụ, Microsoft Access có kiểu dữ liệu text, memo là kiểu chuỗi; SQL Server có kiểu dữ liệu text, char, varchar, nvarchar là kiểu chuỗi.\nMột thuộc tính có thể chỉ chọn lấy những giá trị trong một tập hợp con của kiểu dữ liệu. Tập hợp các giá trị mà một thuộc tính A có thể nhận được gọi là miền giá trị của thuộc tính A, thường được ký hiệu là dom(A).\nVí dụ:\n− Sinhviên (MãSV, TênSV, NămSinh, GiớiTính, ĐịaChỉ)\n− dom(MãSV) = {char(5)}\n− dom(TênSV) = {char(30)}\n− dom(Nămsinh) = {date}\n− dom(GiớiTính) = {0, 1}\n− dom(ĐịaChỉ) = {char(50)}\nBộ (tuple): Một bộ giá trị là các thông tin của một đối tượng thuộc quan hệ. Bộ giá trị cũng thường được gọi là một mẩu tin hay bản ghi (record), dòng của bảng (row). Một bộ q là một vectơ gồm n thành phần thuộc tập hợp con của tích đề các miền giá trị của các thuộc tính và thỏa mãn tân từ đã cho của quan hệ. Ví dụ: các bộ giá trị dựa trên các thuộc tính của quan hệ SINHVIEN\nq1 = (SV001, Trần T.Bình, 1/4/2002, Nam, Hà Nội, VT1)\nq2 = (SV002, Ng.Đ.Trung, 23/2/2002, Nam, Hà Nội, VT2)\nMột lược đồ quan hệ R, ký hiệu là R(A1, A2,..., An), được tạo nên từ một tên R và một danh sách các thuộc tính A1, A2,..., An và dom(Ai) là miền giá trị của Ai\nThể hiện của quan hệ (hoặc trạng thái quan hệ) của lược đồ quan hệ R(A1, A2, ..., An) được ký hiệu là r(R), là tập hợp r(R) = {t1, t2, ..., tm}, trong đó mỗi ti được gọi là một bộ:\n- Mỗi n-bộ t =< v1, v2, . . . , vn > là một danh sách có thứ tự của n giá trị vi, i = 1, n, trong đó mỗi vi, 1 ≤ i ≤ n, là một phần tử của Dom(Ai) hoặc là một giá trị không xác định null.\n- Giá trị thứ i của bộ t được ký hiệu là t[Ai]: t[Ai] = vi\n- Hai bộ t, s trong r(R) được định nghĩa là bằng nhau t = s khi và chỉ khi t[Ai] = s[Ai] ∀i = 1, n\n- Ví dụ thể hiện của quan hệ SINH_VIEN\nCấp (hoặc ngôi) của một quan hệ là số các thuộc tính của lược đồ quan hệ của nó. Ví dụ quan hệ SINH_VIEN có cấp là 6.\nLược đồ CSDL gồm nhiều quan hệ.\nVí dụ:\nGIÁOVIÊN (Mãgv, Họtên, Lương, Phái, Ngàysinh, Sốnhà, Đường, Quận, Thànhphố, Gvqlcm, Mãbm)\nGV_ĐT (Mãgv, Điệnthoại)\nBỘMÔN (Mãbm, Tênbm, Phòng, Điệnthoại, Trưởngbm, Mãkhoa, Ngàynhậnchức)\nKHOA (Mãkhoa, Tênkhoa, Nămtl, Phòng, Điệnthoai, Trưởngkhoa, Ngàynhậnchức)\nĐỀTÀI (Mãđt, Tênđt, Kinhphí, Cấpql, Ngàybđ, Ngàykt, Mãcđ, Gvcnđt)\nCHỦĐỀ (Mãcđ, Têncđ)\nCÔNGVIỆC (Mãđt, Stt, Têncv, Ngàybđ, Ngàykt)\nTHAMGIAĐT(Mãgv, Mãđt, Stt, Phụcấp, Kếtquả)",
              "children": [
                {
                  "level_4_title": "2.6.1.1. Siêu khóa và khóa của lược đồ quan hệ",
                  "level_4_id": "2.6.1.1",
                  "content": "Siêu khóa (Super Key): Một quan hệ được định nghĩa như một tập hợp các bộ. Theo định nghĩa tập hợp, các phần tử của một tập hợp là khác nhau, vì vậy mọi bộ trong quan hệ phải khác nhau. Điều đó có nghĩa là: Không thể có 2 bộ có cùng một tổ hợp giá trị cho tất cả các thuộc tính của chúng. Thông thường, có tồn tại các tập con của các thuộc tính của một lược đồ quan hệ có tính chất là không có 2 bộ nào ở trong mọi trạng thái quan hệ r của R có cùng một tổ hợp giá trị cho các thuộc tính của nó. Giả sử chúng ta ký hiệu một tập con như vậy là S, khi đó với 2 bộ khác nhau bất kỳ t1 và t2 trong một trạng thái quan hệ r của lược đồ quan hệ R chúng ta có ràng buộc là: ∀r, ∀t1, ∀t2 ∈ r, t1 ≠ t2 ⇒ t1[S] ≠ t2[S]. Tập hợp S có các thuộc tính như vậy được gọi là một siêu khóa của lược đồ quan hệ R. Một quan hệ có thể có nhiều siêu khoá. Mỗi quan hệ có ít nhất một siêu khóa mặc định, đó là tập hợp tất cả các thuộc tính của nó.\nKhóa (Key): Một khoá K của một lược đồ quan hệ R là một siêu khóa của R với tính chất là nếu bỏ đi bất kì thuộc tính A nào ra khỏi K thì sẽ còn lại một tập K không phải là siêu khoá của R. Như vậy, một khóa là một siêu khóa tối thiểu. Một quan hệ có thể có nhiều khoá. Trong trường hợp đó mỗi khoá là một khoá dự tuyển. Khoá chính của quan hệ được chọn từ tập hợp các khoá dự tuyển.",
                  "children": []
                }
              ]
            },
            {
              "level_3_title": "2.6.2. CSDL quan hệ và cách tạo lập quan hệ",
              "level_3_id": "2.6.2",
              "content": "Một CSDL quan hệ là một tập các quan hệ được định nghĩa trên một tập các miền. Một CSDL quan hệ bao gồm hai thành phần: Lược đồ CSDL và thể hiện của CSDL. Lược đồ CSDL (Database Schema) là tập hợp các lược đồ quan hệ trong CSDL đó, còn thể hiện của CSDL là tập hợp các thể hiện của các quan hệ trong CSDL.",
              "children": []
            },
            {
              "level_3_title": "2.6.3. Ánh xạ từ mô hình thực thể liên kết sang mô hình quan hệ",
              "level_3_id": "2.6.3",
              "content": "Bước 1: Ánh xạ các tập thực thể mạnh: Với mỗi tập thực thể mạnh E, ta tạo một quan hệ R chứa tất cả các thuộc tính đơn của E. Khóa chính của E trở thành khóa chính của R.\nBước 2: Ánh xạ các tập thực thể yếu: Với mỗi tập thực thể yếu W có chủ là S, ta tạo một quan hệ R và bao gồm tất cả các thuộc tính đơn của W như các thuộc tính của R. Thêm vào các thuộc tính khóa chính của S. Khóa chính của R là tổ hợp của khóa chính của S và thuộc tính phân biệt của W.\nBước 3: Ánh xạ các mối quan hệ (trừ các mối quan hệ 1-1): Với mỗi mối quan hệ nhị phân 1-N giữa S và T, xác định quan hệ S tương ứng với tập thực thể ở phía N. Bao gồm trong S như một khóa ngoài tất cả các thuộc tính của khóa chính của quan hệ T (tương ứng với tập thực thể ở phía 1). Bao gồm tất cả các thuộc tính đơn của mối quan hệ như thuộc tính của S.\nVới mỗi mối quan hệ nhị phân N-N giữa S và T, ta tạo một quan hệ R. Bao gồm tất cả các thuộc tính của khóa chính của S và T như các thuộc tính khóa ngoài trong R. Bao gồm tất cả các thuộc tính đơn của mối quan hệ như các thuộc tính của R. Khóa chính của R là tổ hợp của tất cả các khóa chính của S và T.\nVới mỗi mối quan hệ n ngôi, ta tạo một quan hệ R. Bao gồm tất cả các thuộc tính của các khóa chính của các quan hệ tương ứng với các tập thực thể tham gia như các thuộc tính khóa ngoài trong R. Bao gồm tất cả các thuộc tính đơn của mối quan hệ như các thuộc tính của R. Khóa chính của R là tổ hợp của tất cả các khóa chính của các quan hệ tham gia.\nBước 4: Ánh xạ các mối quan hệ 1-1: Với mỗi mối quan hệ nhị phân 1-1 giữa S và T, có 3 khả năng:\n- Quan hệ kết hợp: tạo một quan hệ R cho mối quan hệ, tương tự như mối quan hệ N-N\n- Khóa ngoài: chọn 1 trong 2 quan hệ S hoặc T và thêm khóa chính của quan hệ còn lại như một khóa ngoài. Nếu một phía là bắt buộc, ta nên chọn quan hệ đó\n- Một quan hệ: kết hợp S và T thành một quan hệ\nBước 5: Ánh xạ các thuộc tính đa trị: Với mỗi thuộc tính đa trị A của tập thực thể E, ta tạo một quan hệ R. R bao gồm thuộc tính A cùng với khóa chính của E. Khóa chính của R là tổ hợp của A và khóa chính của E.\nBước 6: Ánh xạ các kiểu thực thể tổng quát hóa: Với mỗi tổng quát hóa với cha là S và con là T1, T2,... Ta có 3 khả năng:\n- Tạo một quan hệ cho S và một quan hệ cho mỗi Ti. Quan hệ cho Ti bao gồm các thuộc tính của Ti và khóa chính của S. Khóa chính của S cũng là khóa chính của quan hệ của Ti\n- Chỉ tạo quan hệ cho mỗi Ti. Quan hệ cho Ti bao gồm các thuộc tính của nó và các thuộc tính của S\n- Tạo một quan hệ chứa tất cả các thuộc tính của S và tất cả các thuộc tính của các Ti. Thêm một thuộc tính để chỉ ra bộ đó thuộc về Ti nào.",
              "children": []
            },
            {
              "level_3_title": "2.6.4. Các phép toán trên CSDL quan hệ",
              "level_3_id": "2.6.4",
              "content": "Các ngôn ngữ truy vấn trên CSDL quan hệ là các ngôn ngữ bậc cao, không có tính thủ tục. Trong các ngôn ngữ này, người sử dụng không cần phải chỉ ra cách thức lấy dữ liệu mà chỉ cần chỉ ra dữ liệu nào cần phải lấy ra.\nCác ngôn ngữ truy vấn quan hệ được chia thành hai loại:\n- Các ngôn ngữ hình thức, dựa trên các biểu thức toán học. Các ngôn ngữ thuộc loại này là:\n+ Đại số quan hệ\n+ Phép tính quan hệ trên bộ\n+ Phép tính quan hệ trên miền\n- Các ngôn ngữ thương mại, gần với ngôn ngữ tự nhiên, dễ sử dụng. SQL là ngôn ngữ truy vấn được sử dụng rộng rãi nhất.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "2.7. So sánh và đánh giá",
          "level_2_id": "2.7",
          "content": "Bảng 2.7: So sánh các mô hình.\n| Tiêu chí | Mô hình phân cấp | Mô hình mạng | Mô hình quan hệ | Mô hình hướng đối tượng |\n|---|---|---|---|---|\n| Cấu trúc dữ liệu | Cây | Đồ thị | Bảng | Đối tượng |\n| Mối quan hệ giữa các dữ liệu | 1-N | 1-N, N-N | N-N | Kế thừa |\n| Ưu điểm | Đơn giản, dễ cài đặt | Linh hoạt hơn mô hình phân cấp | Đơn giản, linh hoạt, độc lập dữ liệu | Mô hình hóa thế giới thực tốt, tái sử dụng |\n| Nhược điểm | Kém linh hoạt, dư thừa dữ liệu | Phức tạp, khó cài đặt | Hiệu suất thấp hơn các mô hình khác | Phức tạp, chưa có chuẩn chung |",
          "children": []
        },
        {
          "level_2_title": "2.8. Kết luận chương 2",
          "level_2_id": "2.8",
          "content": "Nội dung chương 2 đã trình bày tổng quan về các loại mô hình dữ liệu, đặc biệt đi sâu phân tích mô hình quan hệ thực thể E-R (Entity Relationship) để mô hình hóa các hoạt động trong thế giới thực, nhìn thế giới thực như là một tập các đối tượng căn bản được gọi là các thực thể và các mối quan hệ ở giữa các đối tượng này. Nội dung chương 2 còn trình bày mô hình dữ liệu quan hệ, các quy tắc chuyển đổi cơ sở dữ liệu từ E-R sang mô hình dữ liệu quan hệ, các phép toán trên CSDL quan hệ.",
          "children": []
        }
      ]
    },
    {
      "level_1_title": "CHƯƠNG 3. NGÔN NGỮ ĐỊNH NGHĨA VÀ THAO TÁC DỮ LIỆU ĐỐI VỚI MÔ HÌNH QUAN HỆ",
      "level_1_id": "3",
      "children": [
        {
          "level_2_title": "3.1. Phân loại các ngôn ngữ truy vấn",
          "level_2_id": "3.1",
          "content": "Trình bày các ngôn ngữ truy vấn trên cơ sở dữ liệu. Nội dung chương phân tích chi tiết ngôn ngữ đại số quan hệ và ngôn ngữ truy vấn SQL.",
          "children": []
        },
        {
          "level_2_title": "3.2. Ngôn ngữ đại số quan hệ",
          "level_2_id": "3.2",
          "children": [
            {
              "level_3_title": "3.2.1. Các phép toán lý thuyết tập hợp",
              "level_3_id": "3.2.1",
              "content": "Các phép toán này gồm phép hợp (Union), phép giao (Intersection) và phép trừ (Difference). Các phép toán này được định nghĩa trên hai quan hệ R và S phải khả hợp, tức là hai quan hệ này phải có cùng bậc và miền giá trị của các thuộc tính tương ứng phải giống nhau.\n- Phép hợp: Phép hợp của hai quan hệ R và S, ký hiệu là R ∪ S, là một quan hệ T có cùng lược đồ với R và S. Tập hợp các bộ của T là tập hợp các bộ thuộc R hoặc thuộc S hoặc thuộc cả R và S.\n- Phép giao: Phép giao của hai quan hệ R và S, ký hiệu là R ∩ S, là một quan hệ T có cùng lược đồ với R và S. Tập hợp các bộ của T là tập hợp các bộ thuộc cả R và S.\n- Phép trừ: Phép trừ của hai quan hệ R và S, ký hiệu là R - S, là một quan hệ T có cùng lược đồ với R và S. Tập hợp các bộ của T là tập hợp các bộ thuộc R nhưng không thuộc S.",
              "children": []
            },
            {
              "level_3_title": "3.2.2. Các phép toán đại số quan hệ",
              "level_3_id": "3.2.2",
              "content": "Các phép toán này gồm phép tích Đề-các (Cartesian Product), phép chiếu (Projection), phép chọn (Selection) và phép kết nối (Join).\n- Phép tích Đề-các: Phép tích Đề-các của hai quan hệ R và S, ký hiệu là R x S, là một quan hệ T có lược đồ là sự kết hợp của các lược đồ của R và S. Tập hợp các bộ của T là tập hợp tất cả các bộ có thể được tạo ra bằng cách ghép mỗi bộ của R với mỗi bộ của S.\n- Phép chiếu: Phép chiếu của một quan hệ R trên một tập hợp các thuộc tính A, ký hiệu là πA(R), là một quan hệ T có lược đồ chỉ chứa các thuộc tính trong A. Tập hợp các bộ của T là tập hợp các bộ được tạo ra bằng cách lấy các giá trị của các thuộc tính trong A từ mỗi bộ của R.\n- Phép chọn: Phép chọn của một quan hệ R theo một điều kiện P, ký hiệu là σP(R), là một quan hệ T có cùng lược đồ với R. Tập hợp các bộ của T là tập hợp các bộ của R thỏa mãn điều kiện P.\n- Phép kết nối: Phép kết nối của hai quan hệ R và S trên một điều kiện P, ký hiệu là R ⨝P S, là một quan hệ T có lược đồ là sự kết hợp của các lược đồ của R và S. Tập hợp các bộ của T là tập hợp các bộ được tạo ra bằng cách ghép mỗi bộ của R với mỗi bộ của S nếu chúng thỏa mãn điều kiện P.",
              "children": []
            },
            {
              "level_3_title": "3.2.3. Các phép toán quan hệ bổ sung",
              "level_3_id": "3.2.3",
              "content": "Các phép toán quan hệ bổ sung bao gồm phép chia, phép nối ngoài và các hàm nhóm.\n- Phép chia: Phép chia quan hệ R(A, B) cho quan hệ S(B), ký hiệu R ÷ S, cho kết quả là một quan hệ T(A) chứa các bộ a sao cho với mọi bộ b trong S, bộ (a, b) đều có trong R.\n- Phép nối ngoài (Outer Join): Phép nối ngoài là một biến thể của phép nối, cho phép giữ lại tất cả các bộ từ một hoặc cả hai quan hệ tham gia, ngay cả khi không có bộ tương ứng trong quan hệ kia. Có ba loại phép nối ngoài: nối ngoài trái (Left Outer Join), nối ngoài phải (Right Outer Join) và nối ngoài đầy đủ (Full Outer Join).\n- Hàm nhóm và phép nhóm: Các hàm nhóm (Aggregate Functions) như SUM, AVG, COUNT, MIN, MAX được sử dụng để tính toán trên một nhóm các bộ. Phép nhóm (Grouping) được sử dụng để chia các bộ của một quan hệ thành các nhóm, và sau đó áp dụng hàm nhóm cho mỗi nhóm.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "3.3. Ngôn ngữ truy vấn SQL",
          "level_2_id": "3.3",
          "children": [
            {
              "level_3_title": "3.3.1. Giới thiệu chung về SQL",
              "level_3_id": "3.3.1",
              "content": "SQL (Structured Query Language) là ngôn ngữ chuẩn để làm việc với các CSDL quan hệ. SQL được sử dụng để thực hiện các tác vụ như truy vấn, cập nhật dữ liệu, cũng như định nghĩa và quản lý CSDL. SQL có các thành phần chính sau:\n- Ngôn ngữ định nghĩa dữ liệu (DDL - Data Definition Language)\n- Ngôn ngữ thao tác dữ liệu (DML - Data Manipulation Language)\n- Ngôn ngữ điều khiển dữ liệu (DCL - Data Control Language)\n- Ngôn ngữ truy vấn dữ liệu (DQL - Data Query Language)",
              "children": []
            },
            {
              "level_3_title": "3.3.2. Ngôn ngữ định nghĩa dữ liệu (DDL)",
              "level_3_id": "3.3.2",
              "content": "DDL được sử dụng để định nghĩa và quản lý cấu trúc của CSDL. Các lệnh DDL chính bao gồm:\n- CREATE: Dùng để tạo các đối tượng trong CSDL như bảng (TABLE), khung nhìn (VIEW), chỉ mục (INDEX),...\n- ALTER: Dùng để thay đổi cấu trúc của các đối tượng đã có.\n- DROP: Dùng để xóa các đối tượng khỏi CSDL.\n- TRUNCATE: Dùng để xóa tất cả các bản ghi khỏi một bảng một cách nhanh chóng.",
              "children": []
            },
            {
              "level_3_title": "3.3.3. Ngôn ngữ thao tác dữ liệu (DDM)",
              "level_3_id": "3.3.3",
              "content": "DML được sử dụng để quản lý dữ liệu trong các bảng. Các lệnh DML chính bao gồm:\n- INSERT: Dùng để chèn thêm các bản ghi mới vào một bảng.\n- UPDATE: Dùng để cập nhật các bản ghi đã có trong một bảng.\n- DELETE: Dùng để xóa các bản ghi khỏi một bảng.",
              "children": []
            },
            {
              "level_3_title": "3.3.4. Ngôn ngữ truy vấn dữ liệu (DQL)",
              "level_3_id": "3.3.4",
              "content": "DQL được sử dụng để truy vấn dữ liệu từ CSDL. Lệnh cơ bản và quan trọng nhất của DQL là SELECT.\nCâu lệnh SELECT được sử dụng để lấy dữ liệu từ một hoặc nhiều bảng. Cú pháp cơ bản:\n`SELECT [DISTINCT] danh_sach_cot\nFROM danh_sach_bang\n[WHERE dieu_kien]\n[GROUP BY danh_sach_cot_gom_nhom]\n[HAVING dieu_kien_gom_nhom]\n[ORDER BY danh_sach_cot_sap_xep [ASC|DESC]];`\n- SELECT: Chỉ định các cột cần lấy dữ liệu.\n- FROM: Chỉ định các bảng chứa dữ liệu.\n- WHERE: Lọc các bản ghi theo một điều kiện nhất định.\n- GROUP BY: Nhóm các bản ghi có cùng giá trị trong một hoặc nhiều cột thành các nhóm tóm tắt.\n- HAVING: Lọc các nhóm được tạo bởi GROUP BY.\n- ORDER BY: Sắp xếp kết quả trả về.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "3.4. Kết luận chương 3",
          "level_2_id": "3.4",
          "content": "Nội dung chương 3 đã trình bày các ngôn ngữ truy vấn trên cơ sở dữ liệu. Cụ thể, chương đã phân tích chi tiết ngôn ngữ đại số quan hệ, là nền tảng lý thuyết cho các ngôn ngữ truy vấn quan hệ, và ngôn ngữ truy vấn có cấu trúc SQL, là ngôn ngữ phổ biến nhất được sử dụng trong thực tế để định nghĩa, thao tác và truy vấn dữ liệu trong các hệ quản trị CSDL quan hệ.",
          "children": []
        }
      ]
    },
    {
      "level_1_title": "CHƯƠNG 4. LÝ THUYẾT THIẾT KẾ CƠ SỞ DỮ LIỆU QUAN HỆ",
      "level_1_id": "4",
      "children": [
        {
          "level_2_title": "4.1. Các vấn đề đối với CSDL",
          "level_2_id": "4.1",
          "children": [
            {
              "level_3_title": "4.1.1. Ngữ nghĩa của các thuộc tính quan hệ",
              "level_3_id": "4.1.1",
              "content": "Khi thiết kế một CSDL quan hệ, điều quan trọng là phải đảm bảo rằng ngữ nghĩa của các thuộc tính là rõ ràng. Mỗi bộ trong một quan hệ nên biểu diễn một thực thể hoặc một mối quan hệ duy nhất. Các thuộc tính từ các thực thể hoặc mối quan hệ khác nhau không nên được kết hợp một cách tùy tiện vào một quan hệ duy nhất. Nếu làm vậy, lược đồ sẽ trở nên khó hiểu và khó bảo trì.",
              "children": []
            },
            {
              "level_3_title": "4.1.2. Thông tin dư thừa trong các bộ và sự dị thường cập nhật",
              "level_3_id": "4.1.2",
              "content": "Việc kết hợp quá nhiều thuộc tính vào một lược đồ quan hệ duy nhất có thể dẫn đến sự dư thừa thông tin. Thông tin bị lặp lại trong nhiều bộ, gây lãng phí không gian lưu trữ và quan trọng hơn là gây ra các dị thường cập nhật:\n- Dị thường chèn (Insertion Anomalies): Khó khăn khi chèn một thực thể mới vào CSDL nếu một số thuộc tính của nó chưa xác định.\n- Dị thường xóa (Deletion Anomalies): Việc xóa một bộ có thể vô tình làm mất thông tin về một thực thể khác.\n- Dị thường sửa đổi (Modification Anomalies): Việc sửa đổi một giá trị thuộc tính phải được thực hiện trên tất cả các bộ có chứa giá trị đó, nếu không sẽ dẫn đến tình trạng không nhất quán.",
              "children": []
            },
            {
              "level_3_title": "4.1.3. Các giá trị không xác định trong các bộ",
              "level_3_id": "4.1.3",
              "content": "Một vấn đề khác là sự xuất hiện của các giá trị không xác định (NULL). Giá trị NULL có thể có nhiều ý nghĩa: thuộc tính không áp dụng cho bộ này, giá trị thuộc tính không xác định, hoặc giá trị đã biết nhưng chưa được cung cấp. Việc có quá nhiều giá trị NULL trong một quan hệ có thể gây ra khó khăn trong việc hiểu ý nghĩa của dữ liệu và lãng phí không gian lưu trữ.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "4.2. Phụ thuộc hàm",
          "level_2_id": "4.2",
          "children": [
            {
              "level_3_title": "4.2.1. Định nghĩa phụ thuộc hàm",
              "level_3_id": "4.2.1",
              "content": "Một phụ thuộc hàm (Functional Dependency), ký hiệu X → Y, giữa hai tập thuộc tính X và Y trong một lược đồ quan hệ R, xác định một ràng buộc rằng với hai bộ bất kỳ t1 và t2 trong một thể hiện r của R, nếu t1[X] = t2[X] thì phải có t1[Y] = t2[Y]. Điều này có nghĩa là giá trị của tập thuộc tính X xác định duy nhất giá trị của tập thuộc tính Y. X được gọi là vế trái và Y là vế phải của phụ thuộc hàm.",
              "children": []
            },
            {
              "level_3_title": "4.2.2. Hệ tiên đề Amstrong",
              "level_3_id": "4.2.2",
              "content": "Hệ tiên đề Amstrong là một tập hợp các quy tắc suy diễn cho phép ta suy ra tất cả các phụ thuộc hàm từ một tập hợp các phụ thuộc hàm cho trước. Hệ thống này bao gồm các quy tắc cơ bản sau:\n1.  **Luật phản xạ (Reflexivity):** Nếu Y ⊆ X, thì X → Y.\n2.  **Luật gia tăng (Augmentation):** Nếu X → Y, thì XZ → YZ.\n3.  **Luật bắc cầu (Transitivity):** Nếu X → Y và Y → Z, thì X → Z.\nTừ ba quy tắc này, có thể suy ra các quy tắc hữu ích khác như luật hợp, luật phân rã và luật bắc cầu giả.",
              "children": []
            },
            {
              "level_3_title": "4.2.3. Bao đóng và thuật toán tìm bao đóng",
              "level_3_id": "4.2.3",
              "content": "Bao đóng của một tập phụ thuộc hàm F, ký hiệu F+, là tập hợp tất cả các phụ thuộc hàm có thể được suy ra từ F bằng cách sử dụng hệ tiên đề Amstrong.\nBao đóng của một tập thuộc tính X đối với F, ký hiệu X+, là tập hợp tất cả các thuộc tính A sao cho phụ thuộc hàm X → A có thể được suy ra từ F. Thuật toán tìm bao đóng X+ bắt đầu với X+ = X, sau đó lặp lại việc thêm các thuộc tính từ vế phải của các phụ thuộc hàm trong F có vế trái là tập con của X+ cho đến khi không thể thêm thuộc tính mới nào nữa.",
              "children": []
            },
            {
              "level_3_title": "4.2.4. Khóa và các thuật toán tìm khóa",
              "level_3_id": "4.2.4",
              "content": "Một tập thuộc tính K là một siêu khóa (superkey) của lược đồ quan hệ R nếu K xác định hàm tất cả các thuộc tính của R, tức là K → R. Một khóa (key) là một siêu khóa tối thiểu, tức là không có tập con thực sự nào của K cũng là một siêu khóa. Một lược đồ quan hệ có thể có nhiều khóa, được gọi là các khóa dự tuyển (candidate keys). Một trong các khóa dự tuyển được chọn làm khóa chính (primary key).\nThuật toán tìm khóa có thể dựa trên việc tính bao đóng. Ví dụ, để kiểm tra xem X có phải là siêu khóa không, ta tính X+ và xem nó có chứa tất cả các thuộc tính của R hay không. Để tìm tất cả các khóa, ta có thể bắt đầu với các tập thuộc tính nhỏ và kiểm tra xem chúng có phải là siêu khóa không, sau đó loại bỏ các siêu khóa không tối thiểu.",
              "children": []
            },
            {
              "level_3_title": "4.2.5. Các tập phụ thuộc hàm tối thiểu",
              "level_3_id": "4.2.5",
              "content": "Một tập phụ thuộc hàm F được gọi là tối thiểu (minimal) nếu nó thỏa mãn ba điều kiện sau:\n1.  Mỗi phụ thuộc hàm trong F có vế phải là một thuộc tính đơn.\n2.  Không thể loại bỏ bất kỳ phụ thuộc hàm nào khỏi F mà không làm thay đổi bao đóng F+.\n3.  Không thể loại bỏ bất kỳ thuộc tính nào từ vế trái của bất kỳ phụ thuộc hàm nào trong F mà không làm thay đổi bao đóng F+.\nMọi tập phụ thuộc hàm đều có một tập tối thiểu tương đương. Việc tìm tập tối thiểu là một bước quan trọng trong quá trình thiết kế CSDL, đặc biệt là trong các thuật toán chuẩn hóa.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "4.3. Phép tách - kết nối",
          "level_2_id": "4.3",
          "children": [
            {
              "level_3_title": "4.3.1. Khái niệm",
              "level_3_id": "4.3.1",
              "content": "Phép tách (Decomposition) là quá trình chia một lược đồ quan hệ R thành một tập hợp các lược đồ quan hệ con {R1, R2, ..., Rk} sao cho mỗi Ri là một tập con của các thuộc tính của R và hợp của tất cả các thuộc tính trong các Ri bằng tập thuộc tính của R. Mục đích của phép tách là để loại bỏ các vấn đề như dư thừa dữ liệu và dị thường cập nhật.",
              "children": []
            },
            {
              "level_3_title": "4.3.2. Phép tách-kết nối tự nhiên",
              "level_3_id": "4.3.2",
              "content": "Sau khi tách một quan hệ r thành các quan hệ con r1, r2, ..., rk, ta có thể tái tạo lại quan hệ ban đầu bằng cách sử dụng phép kết nối tự nhiên (Natural Join). Phép kết nối tự nhiên của các ri, ký hiệu r1 ⨝ r2 ⨝ ... ⨝ rk, sẽ tạo ra một quan hệ mới. Một phép tách được coi là tốt nếu quan hệ tái tạo này giống hệt quan hệ ban đầu.",
              "children": []
            },
            {
              "level_3_title": "4.3.3. Phép tách - kết nối không mất mát thông tin",
              "level_3_id": "4.3.3",
              "content": "Một phép tách D = {R1, R2, ..., Rk} của R được gọi là không mất mát thông tin (Lossless-Join Decomposition) đối với một tập phụ thuộc hàm F nếu với mọi thể hiện r của R thỏa mãn F, ta có: r = πR1(r) ⨝ πR2(r) ⨝ ... ⨝ πRk(r).\nĐiều này đảm bảo rằng không có thông tin nào bị mất và không có bộ giả nào được tạo ra khi kết nối lại các quan hệ con. Với một phép tách R thành hai lược đồ con R1 và R2, phép tách là không mất mát thông tin khi và chỉ khi (R1 ∩ R2) → (R1 - R2) hoặc (R1 ∩ R2) → (R2 - R1) nằm trong F+.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "4.4. Chuẩn hóa lược đồ quan hệ",
          "level_2_id": "4.4",
          "children": [
            {
              "level_3_title": "4.4.1. Dạng chuẩn 1NF và chuẩn hóa về 1NF",
              "level_3_id": "4.4.1",
              "content": "Dạng chuẩn thứ nhất (First Normal Form - 1NF) yêu cầu rằng miền giá trị của tất cả các thuộc tính trong một quan hệ phải là nguyên tố. Điều này có nghĩa là giá trị của mỗi thuộc tính trong mỗi bộ phải là một giá trị đơn, không thể phân chia, chứ không phải là một tập hợp hay một danh sách các giá trị. Hầu hết các hệ quản trị CSDL quan hệ hiện đại đều yêu cầu các bảng phải tuân thủ 1NF.",
              "children": []
            },
            {
              "level_3_title": "4.4.2. Dạng chuẩn 2NF và chuẩn hóa về 2NF",
              "level_3_id": "4.4.2",
              "content": "Dạng chuẩn thứ hai (Second Normal Form - 2NF) áp dụng cho các lược đồ quan hệ có khóa chính là khóa phức hợp. Một lược đồ quan hệ R ở dạng chuẩn 1NF được coi là ở dạng chuẩn 2NF nếu mọi thuộc tính không khóa (non-prime attribute) của R đều phụ thuộc hàm đầy đủ vào khóa chính. Nếu có một thuộc tính không khóa nào đó chỉ phụ thuộc vào một phần của khóa chính, thì lược đồ đó vi phạm 2NF. Để chuẩn hóa về 2NF, ta tách các phụ thuộc hàm riêng phần ra thành các quan hệ mới.",
              "children": []
            },
            {
              "level_3_title": "4.4.3. Dạng chuẩn 3NF và chuẩn hóa về 3NF",
              "level_3_id": "4.4.3",
              "content": "Dạng chuẩn thứ ba (Third Normal Form - 3NF) dựa trên khái niệm phụ thuộc bắc cầu. Một lược đồ quan hệ R ở dạng chuẩn 2NF được coi là ở dạng chuẩn 3NF nếu không có thuộc tính không khóa nào của R phụ thuộc bắc cầu vào khóa chính. Nói cách khác, với mọi phụ thuộc hàm không tầm thường X → A trong F+, hoặc X là một siêu khóa của R, hoặc A là một thuộc tính khóa (prime attribute) của R. Chuẩn hóa về 3NF giúp loại bỏ các dị thường cập nhật gây ra bởi phụ thuộc bắc cầu.",
              "children": []
            },
            {
              "level_3_title": "4.4.4. Dạng chuẩn BCNF và chuẩn hóa về BCNF",
              "level_3_id": "4.4.4",
              "content": "Dạng chuẩn Boyce-Codd (Boyce-Codd Normal Form - BCNF) là một dạng chuẩn mạnh hơn 3NF. Một lược đồ quan hệ R được coi là ở dạng chuẩn BCNF nếu với mọi phụ thuộc hàm không tầm thường X → A trong F+, X phải là một siêu khóa của R. BCNF loại bỏ tất cả các dư thừa dựa trên phụ thuộc hàm. Một lược đồ ở dạng BCNF cũng ở dạng 3NF, nhưng điều ngược lại không phải lúc nào cũng đúng.",
              "children": []
            },
            {
              "level_3_title": "4.4.5. Chuẩn hoá qua phép tách không làm mất thông tin",
              "level_3_id": "4.4.5",
              "content": "Mục tiêu của thiết kế CSDL là tạo ra một tập hợp các lược đồ quan hệ ở dạng chuẩn cao (thường là 3NF hoặc BCNF) mà phép tách đó vừa không mất mát thông tin, vừa bảo toàn phụ thuộc hàm. Thuật toán tổng hợp (synthesis algorithm) cho phép tạo ra một tập các lược đồ ở dạng 3NF, không mất mát thông tin và bảo toàn phụ thuộc. Tuy nhiên, việc đạt được BCNF trong khi vẫn bảo toàn tất cả các phụ thuộc hàm không phải lúc nào cũng khả thi. Trong những trường hợp đó, người thiết kế có thể phải lựa chọn giữa BCNF và việc bảo toàn phụ thuộc.",
              "children": []
            }
          ]
        },
        {
          "level_2_title": "4.5. Kết luận chương 4:",
          "level_2_id": "4.5",
          "content": "Nội dung chương 4 đã trình bày các khái niệm lý thuyết nền tảng cho việc thiết kế một CSDL quan hệ tốt. Các khái niệm chính bao gồm phụ thuộc hàm, các quy tắc suy diễn, bao đóng, và khóa. Dựa trên các khái niệm này, chương đã giới thiệu quy trình chuẩn hóa, một kỹ thuật từng bước để loại bỏ dư thừa dữ liệu và các dị thường cập nhật bằng cách tách các lược đồ quan hệ thành các dạng chuẩn cao hơn như 1NF, 2NF, 3NF và BCNF. Mục tiêu là tạo ra một thiết kế CSDL vừa không mất mát thông tin, vừa bảo toàn các ràng buộc dữ liệu quan trọng.",
          "children": []
        }
      ]
    }
  ]
}